





Network Working Group                                          C. Newman
Internet Draft: ACAP                                            Innosoft
Document: draft-ietf-acap-spec-04.txt                        J. G. Myers
                                                                Netscape
                                                               June 1997
                                                   Expires in six months


           ACAP -- Application Configuration Access Protocol


Status of this Memo

   This document is an Internet-Draft.  Internet-Drafts are working
   documents of the Internet Engineering Task Force (IETF), its areas,
   and its working groups.  Note that other groups may also distribute
   working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   To view the entire list of current Internet-Drafts, please check the
   "1id-abstracts.txt" listing contained in the Internet-Drafts Shadow
   Directories on ftp.is.co.za (Africa), ftp.nordu.net (Europe),
   munnari.oz.au (Pacific Rim), ds.internic.net (US East Coast), or
   ftp.isi.edu (US West Coast).

Abstract

   The Application Configuration Access Protocol (ACAP) is designed to
   support remote storage and access of program option, configuration
   and preference information.  The data store model is designed to
   allow a client relatively simple access to interesting data, to allow
   new information to be easily added without server re-configuration,
   and to promote the use of both standardized data and custom or
   proprietary data.  Key features include "inheritance" which can be
   used to manage default values for configuration settings and access
   control lists which allow interesting personal information to be
   shared and group information to be restricted.










Newman                                                          [Page i]

Internet DRAFT                    ACAP                     June 19, 1997





                           Table of Contents



Status of this Memo ...............................................    i
Abstract ..........................................................    i
ACAP Protocol Specification .......................................    1
0.       Changes from version -03 to version -04 ..................    1
0.1.     Open Issues ..............................................    3
1.       Introduction .............................................    3
1.1.     Conventions Used in this Document ........................    3
1.2.     ACAP Data Model ..........................................    3
1.3.     ACAP Design Goals ........................................    3
1.4.     Validation ...............................................    4
1.5.     Definitions ..............................................    4
1.6.     ACAP Command Overview ....................................    6
2.       Protocol Framework .......................................    6
2.1.     Link Level ...............................................    6
2.2.     Commands and Responses ...................................    6
2.2.1.   Client Protocol Sender and Server Protocol Receiver ......    6
2.2.2.   Server Protocol Sender and Client Protocol Receiver ......    7
2.3.     Server States ............................................    8
2.3.1.   Non-Authenticated State ..................................    8
2.3.2.   Authenticated State ......................................    8
2.3.3.   Logout State .............................................    8
2.4.     Operational Considerations ...............................    9
2.4.1.   Untagged Status Updates ..................................    9
2.4.2.   Response when No Command in Progress .....................    9
2.4.3.   Auto-logout Timer ........................................    9
2.4.4.   Multiple Commands in Progress ............................   10
2.5.     Server Command Continuation Request ......................   10
2.6.     Data Formats .............................................   10
2.6.1.   Atom .....................................................   11
2.6.2.   Number ...................................................   11
2.6.3.   String ...................................................   11
2.6.3.1. 8-bit and Binary Strings .................................   12
2.6.4.   Parenthesized List .......................................   12
2.6.5.   NIL ......................................................   12
3.       Protocol Elements ........................................   12
3.1.     Entries and Attributes ...................................   12
3.1.1.   Predefined Attributes ....................................   13
3.1.2.   Attribute metadata .......................................   14
3.2.     ACAP URL scheme ..........................................   15
3.2.1.   ACAP URL User Name and Authentication Mechanism ..........   15
3.2.2.   Relative ACAP URLs .......................................   16



Newman                                                         [Page ii]

Internet DRAFT                    ACAP                     June 19, 1997


3.3.     Contexts .................................................   16
3.4.     Comparators ..............................................   17
3.5.     Access Control Lists (ACLs) ..............................   18
3.6.     Server Response Codes ....................................   20
4.       Namespace Conventions ....................................   22
4.1.     Dataset Namespace ........................................   22
4.2.     Attribute Namespace ......................................   23
4.3.     Formal Syntax for Dataset and Attribute Namespace ........   23
5.       Dataset Management .......................................   25
5.1.     Dataset Inheritance ......................................   25
5.2.     Dataset Attributes .......................................   25
5.3.     Dataset Creation .........................................   26
5.4.     Dataset Class Capabilities ...............................   26
5.5.     Dataset Quotas ...........................................   27
6.       Command and Response Specifications ......................   28
6.1.     Initial Connection .......................................   29
6.1.1.   ACAP Untagged Response ...................................   29
6.2.     Any State ................................................   30
6.2.1.   NOOP Command .............................................   30
6.2.2.   LANG Command .............................................   30
6.2.3.   LANG Untagged Response ...................................   31
6.2.4.   LOGOUT Command ...........................................   31
6.2.5.   OK Response ..............................................   31
6.2.6.   NO Response ..............................................   32
6.2.7.   BAD Response .............................................   32
6.2.8.   BYE Untagged Response ....................................   33
6.2.9.   ALERT Untagged Response ..................................   33
6.3.     Non-Authenticated State ..................................   33
6.3.1.   AUTHENTICATE Command .....................................   34
6.4.     Searching ................................................   35
6.4.1.   SEARCH Command ...........................................   35
6.4.2.   ENTRY Intermediate Response ..............................   40
6.4.3.   MODTIME Intermediate Response ............................   40
6.4.4.   REFER Intermediate Response ..............................   40
6.5.     Contexts .................................................   41
6.5.1.   FREECONTEXT Command ......................................   41
6.5.2.   UPDATECONTEXT Command ....................................   41
6.5.3.   ADDTO Untagged Response ..................................   42
6.5.4.   REMOVEFROM Untagged Response .............................   42
6.5.5.   CHANGE Untagged Response .................................   43
6.5.6.   MODTIME Untagged Response ................................   43
6.6.     Dataset modification .....................................   44
6.6.1.   STORE Command ............................................   44
6.6.2.   DELETEDSINCE Command .....................................   45
6.6.3.   DELETED Intermediate Response ............................   46
6.7.     Access Control List Commands .............................   46
6.7.1.   SETACL Command ...........................................   46
6.7.2.   DELETEACL Command ........................................   47



Newman                                                        [Page iii]

Internet DRAFT                    ACAP                     June 19, 1997


6.7.3.   MYRIGHTS Command .........................................   47
6.7.4.   MYRIGHTS Intermediate Response ...........................   48
6.7.5.   LISTRIGHTS Command .......................................   48
6.7.6.   LISTRIGHTS Intermediate Response .........................   49
6.8.     Quotas ...................................................   49
6.8.1.   GETQUOTA Command .........................................   49
6.8.3.   QUOTA Untagged Response ..................................   50
6.9.     Extensions ...............................................   50
7.       Registration Procedures ..................................   50
7.1.     Comparators ..............................................   51
7.2.     ACAP Capabilities ........................................   51
7.3.     ACAP Response Codes ......................................   52
7.4.     Dataset Classes ..........................................   52
7.5.     Vendor Subtree ...........................................   53
8.       Formal Syntax ............................................   53
9.       Multi-lingual Considerations .............................   63
10.      Security Considerations ..................................   64
11.      Acknowledgments ..........................................   64
12.      Authors' Addresses .......................................   64
Appendices ........................................................   65
A.       References ...............................................   65
B.       ACAP Keyword Index .......................................   67





























Newman                                                         [Page iv]

Internet DRAFT                    ACAP                     June 19, 1997


ACAP Protocol Specification


0.       Changes from version -03 to version -04

   1) Changed ABNF reference to use new ABNF spec, added UTF-8 syntax
   and got rid of all <description> stuff in grammar.

   2) Added length limit of 32 on tags.

   3) Renamed "ordering function" to "comparator"

   4) Put "" around comparator, made "+" / "-" optional.

   5) Added SUBSTRING and PREFIX search keys.

   6) Added multi-valued attributes.

   7) Restricted numbers to 32-bit values.

   8) Added description of data model and design goals.

   9) Permit multiple referrals.

   10) Simplified ACAP URL.

   11) Noted that UNCHANGEDSINCE with a time of "00000101000000" will
   always fail if the entry exists.

   12) Used "base dataset" rather than "inherited dataset"

   13) Fixed ABNF to group results for each RETURN item.

   14) Forbid use of "*" or "%" in attribute name.

   15) Added TRYCACHE response code.

   16) Clarified that any two STORE operations must result in different
   modtimes, even if simultaneous.

   17) Added recommendation that all servers support the PLAIN SASL
   mechanism and SHOULD support an encryption layer or stronger
   standards track SASL mechanism.

   18) Added a bunch of text to security considerations section after
   being warned that the IESG is becoming much more stringent about
   security considerations.  Comments would be appreciated.




Newman                                                          [Page 1]

Internet DRAFT                    ACAP                     June 19, 1997


   19) Noted that change responses are not issued for implicit
   renumbering.

   20) Removed ".bin" attribute naming convention.

   21) Removed partial fetch attribute.

   22) Removed "o" ACL bit.

   23) Added acl-object argument to PERMISSION error.

   24) Atoms must begin with a letter to distinguish them from numbers.
   Added that atoms are used for protocol keywords.

   25) Make ALERT a separate untagged response

   26) Change NOTIFYCONTEXT to MAKECONTEXT [ENUMERATE] [NOTIFY]

   27) Added Multi-lingual considerations section

   28) Updated STORE grammar to deal with multiple writable metadata
   items and multi-valued attributes.

   29) make metadata item names be quoted strings

   30) Fixed LISTRIGHTS, SETACL examples.

   31) Added dataset creation section, dataset capabilities section.

   32) Added NOINHERIT SEARCH modifier.

   33) Added NOEXIST response code and NOCREATE store modifier.

   34) Added LANG command.

   35) Added user specific and site specific attribute namespaces.

   36) Removed SETQUOTA command, added description of /quota dataset
   class.  SETQUOTA was broken because it didn't fall under the auspices
   of ACAP's ACL system.

   37) Allow servers to implement schemes to defeat client polling with
   UPDATECONTEXT.

   38) Forbid duplicate search modifiers, store modifiers, store
   entries, store entry attributes, store attribute metadata.





Newman                                                          [Page 2]

Internet DRAFT                    ACAP                     June 19, 1997


0.1.     Open Issues

   1) Consider making ACL model more precise.  Would like to pick AFS
   semantics over POSIX semantics since AFS semantics are more
   intuitive.  Currently both ACL semantics are permitted.

   2) Need more examples.

   3) Descriptive comparator naming, including vendor naming.

1.       Introduction

1.1.     Conventions Used in this Document

   In examples, "C:" and "S:" indicate lines sent by the client and
   server respectively.  If such lines are wrapped without a new "C:" or
   "S:" label, then the wrapping is for editorial clarity and is not
   part of the command.

   The key words "REQUIRED", "MUST", "MUST NOT", "SHOULD", "SHOULD NOT",
   and "MAY" in this document are to be interpreted as described in "Key
   words for use in RFCs to Indicate Requirement Levels" [KEYWORDS].

1.2.     ACAP Data Model

   An ACAP server exports a hierarchical tree of entries.  Each level of
   the tree is called a dataset, and each dataset is made up of a list
   of entries.  Each entry has a unique name and may contain any number
   of named attributes.  Each attribute within an entry may be single
   valued or multi-valued and may have associated metadata to assist
   access and interpretation of the value.

   The rules with which a client interprets the data within a portion of
   ACAP's tree of entries are called a dataset class.

1.3.     ACAP Design Goals

   ACAP's primary purpose is to allow users access to their
   configuration data from multiple network-connected computers.  Users
   can then sit down in front of any network-connected computer, run any
   ACAP-enabled application and have access to their own configuration
   data.  Because it is hoped that many applications will become ACAP-
   enabled, client simplicity was preferred to server or protocol
   simplicity whenever reasonable.

   ACAP is designed to be easily manageable.  For this reason, it
   includes "inheritance" which allows one dataset to inherit default
   attributes from another dataset.  In addition, access control lists



Newman                                                          [Page 3]

Internet DRAFT                    ACAP                     June 19, 1997


   are included to permit delegation of management and quotas are
   included to prevent storage abuse.  Finally, an ACAP server which is
   conformant to this base specification should be able to support most
   dataset classes defined in the future without requiring a server
   reconfiguration or upgrade.

   ACAP is designed to operate well with a client that only has
   intermittent access to an ACAP server.  For this reason, each entry
   has a server maintained modification time so that the client may
   detect changes.  In addition, the client may ask the server for a
   list of entries which have been removed since it last accessed the
   server.

   ACAP presumes that a dataset may be potentially large and/or the
   client's network connection may be slow, and thus offers server
   sorting, selective fetching and change notification for entries
   within a dataset.

   As required for most Internet protocols, security, scalability and
   internationalization were important design goals.

   Given these design goals, an attempt was made to keep ACAP as simple
   as possible.  It is a traditional Internet text based protocol which
   massively simplifies protocol debugging.  It was designed based on
   the successful IMAP [IMAP4] protocol framework, with a few minor
   simplifications.

1.4.     Validation

   By default, any value may be stored in any attribute for which the
   user has appropriate permission and quota.  This rule is necessary to
   allow the addition of new simple dataset classes without
   reconfiguring or upgrading the server.

   In some cases, such as when the value has special meaning to the
   server, it is useful to have the server enforce validation by
   returning the INVALID response code to a STORE command. These cases
   MUST be explicitly identified in the dataset class specification
   which SHOULD include specific fixed rules for validation.  Since a
   given ACAP server may be unaware of any particular dataset class
   specification, clients MUST NOT depend on the presence of enforced
   validation on the server.

1.5.     Definitions


   access control list (ACL)
        A set of identifier, rights pairs associated with an object.  An



Newman                                                          [Page 4]

Internet DRAFT                    ACAP                     June 19, 1997


        ACL is used to determine which operations a user is permitted to
        perform on that object.  See section ###.

   attribute
        A named value within an entry.  See section ###.

   comparator
        A named function which can be used to perform one or more of
        three comparison operations: ordering, equality and substring
        matching.  See section ###.

   context
        An ordered subset of entries in a dataset, created by a SEARCH
        command with a MAKECONTEXT modifier.  See section ###.

   dataset
        One level of hierarchy in ACAP's tree of entries.  See section
        ###.

   dataset class specification
        The rules which allow a client to interpret the data within a
        portion of ACAP's tree of entries.

   entry
        A set of attributes with a unique entry name.  See section ###.

   metadata
        Information describing an attribute, its value and any access
        controls associated with that attribute.  See section ###.

   NIL  This represents the non-existence of a particular data item.

   NUL  A control character encoded as 0 in US-ASCII [US-ASCII].

   octet
        An 8-bit value.  On most modern computer systems, an octet is
        one byte.

   SASL Simple Authentication and Security Layer [SASL].

   UTC  Universal Coordinated Time as maintained by the Bureau
        International des Poids et Mesures (BIPM).

   UTF-8
        An 8-bit transformation format of the Universal Character Set
        [UTF8].  Note that an incompatible change was made to the coded
        character set referenced by [UTF8], so for the purpose of this
        document, UTF-8 refers to the UTF-8 encoding as defined by



Newman                                                          [Page 5]

Internet DRAFT                    ACAP                     June 19, 1997


        version 2.0 of Unicode [UNICODE-2], or ISO 10646 [ISO-10646]
        including amendments one through seven.


1.6.     ACAP Command Overview

   The AUTHENTICATE, NOOP, LANG and LOGOUT commands provide basic
   protocol services.  The SEARCH command is used to select, sort, fetch
   and monitor changes to attribute values and metadata.  The
   UPDATECONTEXT and FREECONTEXT commands are also used to assist in
   monitoring changes in attribute values and metadata.  The STORE
   command is used to add, modify and delete entries and attributes.
   The DELETEDSINCE command is used to assist a client in
   re-synchronizing a cache with the server.  The GETQUOTA, SETACL,
   DELETEACL, LISTRIGHTS and MYRIGHTS commands are used to examine
   storage quotas and examine or modify access permissions.

2.       Protocol Framework

2.1.     Link Level

   The ACAP protocol assumes a reliable data stream such as provided by
   TCP.  When TCP is used, an ACAP server listens on port 674.

2.2.     Commands and Responses

   An ACAP session consists of the establishment of a client/server
   connection, an initial greeting from the server, and client/server
   interactions.  These client/server interactions consist of a client
   command, server data, and a server completion result.

   All interactions transmitted by client and server are in the form of
   lines; that is, strings that end with a CRLF.  The protocol receiver
   of an ACAP client or server is either reading a line, or is reading a
   sequence of octets with a known count followed by a line.  Both
   clients and servers must be capable of handling lines of arbitrary
   length.

2.2.1.   Client Protocol Sender and Server Protocol Receiver

   The client command begins an operation.  Each client command is
   prefixed with a identifier (an alphanumeric string of no more than 32
   characters, e.g., A0001, A0002, etc.) called a "tag".  A different
   tag is generated by the client for each command.

   There are two cases in which a line from the client does not
   represent a complete command.  In one case, a command argument is
   quoted with an octet count (see the description of literal in section



Newman                                                          [Page 6]

Internet DRAFT                    ACAP                     June 19, 1997


   ###); in the other case, the command arguments require server
   feedback (see the AUTHENTICATE command).  In some of these cases, the
   server sends a command continuation request if it is ready for the
   next part of the command.  This response is prefixed with the token
   "+".

        Note: If, instead, the server detected an error in the
        command, it sends a BAD completion response with tag
        matching the command (as described below) to reject the
        command and prevent the client from sending any more of the
        command.

        It is also possible for the server to send a completion or
        intermediate response for some other command (if multiple
        commands are in progress), or untagged data.  In either
        case, the command continuation request is still pending;
        the client takes the appropriate action for the response,
        and reads another response from the server.

   The ACAP server reads a command line from the client, parses the
   command and its arguments, and transmits server data and a server
   command completion result.

2.2.2.   Server Protocol Sender and Client Protocol Receiver

   Data transmitted by the server to the client come in four forms:
   command continuation requests, command completion results,
   intermediate responses, and untagged responses.

   A command continuation request is prefixed with the token "+".

   A command completion result indicates the success or failure of the
   operation.  It is tagged with the same tag as the client command
   which began the operation.  Thus, if more than one command is in
   progress, the tag in a server completion response identifies the
   command to which the response applies.  There are three possible
   server completion responses: OK (indicating success), NO (indicating
   failure), or BAD (indicating protocol error such as unrecognized
   command or command syntax error).

   An intermediate response returns data which can only be interpreted
   within the context of a command in progress.  It is tagged with the
   same tag as the client command which began the operation.  Thus, if
   more than one command is in progress, the tag in an intermediate
   response identifies the command to which the response applies.  A
   tagged response other than "OK", "NO", or "BAD" is an intermediate
   response.




Newman                                                          [Page 7]

Internet DRAFT                    ACAP                     June 19, 1997


   An untagged response returns data or status messages which may be
   interpreted outside the context of a command in progress.  It is
   prefixed with the token "*".  Untagged data may be sent as a result
   of a client command, or may be sent unilaterally by the server.
   There is no syntactic difference between untagged data that resulted
   from a specific command and untagged data that were sent
   unilaterally.

   The protocol receiver of an ACAP client reads a response line from
   the server.  It then takes action on the response based upon the
   first token of the response, which may be a tag, a "*", or a "+" as
   described above.

   A client MUST be prepared to accept any server response at all times.
   This includes untagged data that it may not have requested.

   This topic is discussed in greater detail in the Server Responses
   section.

2.3.     Server States

   An ACAP server is in one of three states.  Most commands are valid in
   only certain states.  It is a protocol error for the client to
   attempt a command while the server is in an inappropriate state for
   that command.  In this case, a server will respond with a BAD command
   completion result.

2.3.1.   Non-Authenticated State

   In non-authenticated state, the user must supply authentication
   credentials before most commands will be permitted.  This state is
   entered when a connection starts.

2.3.2.   Authenticated State

   In authenticated state, the user is authenticated and most commands
   will be permitted.  This state is entered when acceptable
   authentication credentials have been provided.

2.3.3.   Logout State

   In logout state, the session is being terminated, and the server will
   close the connection.  This state can be entered as a result of a
   client request or by unilateral server decision.







Newman                                                          [Page 8]

Internet DRAFT                    ACAP                     June 19, 1997


            +--------------------------------------+
            |initial connection and server greeting|
            +--------------------------------------+
                      || (1)                  || (2)
                      VV                      ||
            +-----------------+               ||
            |non-authenticated|               ||
            +-----------------+               ||
             || (4)      || (3)               ||
             ||          VV                   ||
             ||          +----------------+   ||
             ||          | authenticated  |   ||
             ||          +----------------+   ||
             ||            || (4)             ||
             VV            VV                 VV
            +--------------------------------------+
            |     logout and close connection      |
            +--------------------------------------+

         (1) connection (ACAP greeting)
         (2) rejected connection (BYE greeting)
         (3) successful AUTHENTICATE command
         (4) LOGOUT command, server shutdown, or connection closed

2.4.     Operational Considerations


2.4.1.   Untagged Status Updates

   At any time, a server can send data that the client did not request.

2.4.2.   Response when No Command in Progress

   Server implementations are permitted to send an untagged response
   while there is no command in progress.  Server implementations that
   send such responses MUST deal with flow control considerations.
   Specifically, they must either (1) verify that the size of the data
   does not exceed the underlying transport's available window size, or
   (2) use non-blocking writes.

2.4.3.   Auto-logout Timer

   If a server has an inactivity auto-logout timer, that timer MUST be
   of at least 30 minutes duration.  The receipt of ANY command from the
   client during that interval MUST suffice to reset the auto-logout
   timer.





Newman                                                          [Page 9]

Internet DRAFT                    ACAP                     June 19, 1997


2.4.4.   Multiple Commands in Progress

   The client is not required to wait for the completion result of a
   command before sending another command, subject to flow control
   constraints on the underlying data stream.  Similarly, a server is
   not required to process a command to completion before beginning
   processing of the next command, unless an ambiguity would result
   because of a command that would affect the results of other commands.
   If there is such an ambiguity, the server executes commands to
   completion in the order given by the client.

2.5.     Server Command Continuation Request

   The command continuation request is indicated by a "+" token instead
   of a tag.  This indicates that the server is ready to accept the
   continuation of a command from the client.

   This response is used in the AUTHENTICATE command to transmit server
   data to the client, and request additional client data.  This
   response is also used if an argument to any command is a
   synchronizing literal.

   The client is not permitted to send the octets of a synchronizing
   literal unless the server indicates that it expects it.  This permits
   the server to process commands and reject errors on a line-by-line
   basis, assuming it checks for non-synchronizing literals at the end
   of each line.  The remainder of the command, including the CRLF that
   terminates a command, follows the octets of the literal.  If there
   are any additional command arguments the literal octets are followed
   by a space and those arguments.

   Example:    C: A099 FREECONTEXT {10}
               S: + "Ready for additional command text"
               C: FRED
               C: FOOB
               S: A099 OK "FREECONTEXT completed"
               C: A044 BLURDYBLOOP {102856}
               S: A044 BAD "No such command as 'BLURDYBLOOP'"


2.6.     Data Formats

   ACAP uses textual commands and responses.  Data in ACAP can be in one
   of five forms: atom, number, string, parenthesized list or NIL.







Newman                                                         [Page 10]

Internet DRAFT                    ACAP                     June 19, 1997


2.6.1.   Atom

   An atom consists of one to 1024 non-special characters.  It must
   begin with a letter.  Atoms are used for protocol keywords.

2.6.2.   Number

   A number consists of one or more digit characters, and represents a
   numeric value.  Numbers are restricted to the range of an unsigned
   32-bit integer: 0 < number < 4,294,967,296.

2.6.3.   String

   A string is in one of two forms: literal and quoted string.  The
   literal form is the general form of string.  The quoted string form
   is an alternative that avoids the overhead of processing a literal at
   the cost of restrictions of what may be in a quoted string.

   A literal is a sequence of zero or more octets (including CR and LF),
   prefix-quoted with an octet count in the form of an open brace ("{"),
   the number of octets, close brace ("}"), and CRLF.  In the case of
   literals transmitted from server to client, the CRLF is immediately
   followed by the octet data.

   There are two forms of literals transmitted from client to server.
   The form where the open brace ("{") and number of octets is
   immediately followed by a close brace ("}") and CRLF is called a
   synchronizing literal.  When sending a synchronizing literal, the
   client must wait to receive a command continuation request (described
   later in this document) before sending the octet data (and the
   remainder of the command).  The other form of literal, the
   non-synchronizing literal, is used to transmit a string from client
   to server without waiting for a command continuation request.  The
   non-synchronizing literal differs from the synchronizing literal by
   having a plus ("+") between the number of octets and the close brace
   ("}") and by having the octet data immediately following the CRLF.

   A quoted string is a sequence of zero to 1024 octets excluding NUL,
   CR and LF, with double quote (<">) characters at each end.

   The empty string is represented as "" (a quoted string with zero
   characters between double quotes), as {0} followed by CRLF (a
   synchronizing literal with an octet count of 0), or as {0+} followed
   by a CRLF (a non-synchronizing literal with an octet count of 0).

        Note: Even if the octet count is 0, a client transmitting a
        synchronizing literal must wait to receive a command
        continuation request.



Newman                                                         [Page 11]

Internet DRAFT                    ACAP                     June 19, 1997


2.6.3.1. 8-bit and Binary Strings

   Most strings in ACAP are restricted to UTF-8 characters and may not
   contain NUL octets.  Attribute values MAY contain any octets
   including NUL.

2.6.4.   Parenthesized List

   Data structures are represented as a "parenthesized list"; a sequence
   of data items, delimited by space, and bounded at each end by
   parentheses.  A parenthesized list can contain other parenthesized
   lists, using multiple levels of parentheses to indicate nesting.

   The empty list is represented as () -- a parenthesized list with no
   members.

2.6.5.   NIL

   The special atom "NIL" represents the non-existence of a particular
   data item that is represented as a string or parenthesized list, as
   distinct from the empty string "" or the empty parenthesized list ().

3.       Protocol Elements

   This section defines data formats and other protocol elements used
   throughout the ACAP protocol.

3.1.     Entries and Attributes

   Within a dataset, each entry name is made up of zero or more UTF-8
   characters other than slash ("/").  A slash separated list of
   entries, one at each level of the hierarchy, forms the full path to
   an entry.

   Each entry is made up of a set of attributes.  Each attribute has a
   hierarchical name in UTF-8, with each component of the name separated
   by a period (".").

   The value of an attribute is either single or multi-valued.  A single
   value is NIL (has no value), or a string of zero or more octets.  A
   multi-value is a list of zero or more strings, each of zero or more
   octets.

   Attribute names are not permitted to contain asterisk ("*") or
   percent ("%") and MUST be valid UTF-8 strings which do not contain
   NUL.  Invalid attribute names result in a BAD response.  Entry names
   are not permitted to begin with "." or contain slash ("/") and MUST
   be valid UTF-8 strings which do not contain NUL.  Invalid entry names



Newman                                                         [Page 12]

Internet DRAFT                    ACAP                     June 19, 1997


   in the entry field of a command result in a BAD response.

   Use of non-visible UTF-8 characters in attribute and entry names is
   discouraged.

3.1.1.   Predefined Attributes

   Attribute names which do not contain a dot (".") are reserved for
   standardized attributes which have meaning in any dataset.  The
   following attributes are defined by the ACAP protocol.

   entry
        Contains the name of the entry.  MUST be single valued.
        Attempts to use illegal or multi-valued values for the entry
        attribute are protocol errors and MUST result in a BAD
        completion response.  This is a special case.

   modtime
        Contains the date and time any read-write metadata in the entry
        was last modified.  This value MUST be in UTC, MUST be
        automatically updated by the server.

        The value consists of 14 or more US-ASCII digits.  The first
        four indicate the year, the next two indicate the month, the
        next two indicate the day of month, the next two indicate the
        hour (0 - 23), the next two indicate the minute, and the next
        two indicate the second.  Any further digits indicate fractions
        of a second.

        The time, particularly fractions of a second, need not be
        accurate.  It is REQUIRED, however, that any two entries in a
        dataset changed by successive modifications have strictly
        ascending modtime values.  In addition, each STORE command
        within a dataset (including simultaneous stores from different
        connections) MUST use different modtime values.

        This attribute has enforced validation, so any attempt to STORE
        a value in this attribute MUST result in a NO response with an
        INVALID response code.

   subdataset
        If this attribute is set, it indicates the existence of a sub-
        dataset of this entry.

        The value consists of a list of relative ACAP URLs (see section
        ###) which may be used to locate the sub-dataset.  The base URL
        is the full path to the entry followed by a slash ("/").  The
        value "." indicates a subdataset is located directly under this



Newman                                                         [Page 13]

Internet DRAFT                    ACAP                     June 19, 1997


        one.  Multiple values indicate replicated copies of the
        subdataset.

        For example, if the dataset "/folder/site/" has an entry
        "public-folder" with a subdataset attribute of ".", then there
        exists a dataset "/folder/site/public-folder/".  If the value of
        the subdataset attribute was instead
        "//other.acap.domain//folder/site/public-folder/" that would
        indicate the dataset is actually located on a different ACAP
        server.

        A dataset can be created by storing a "subdataset" attribute
        including ".", and a sub-hierarchy of datasets is deleted by
        storing a NIL value to the "subdataset" attribute on the entry
        in the parent dataset.

        This attribute has enforced syntax validation.  Specifically, if
        an attempt is made to STORE a single-value (other than NIL), an
        empty list, or one of the values does not follow the URL syntax
        rules [BASIC-URL], then this will result in a NO response with
        an INVALID response code.


3.1.2.   Attribute metadata

   Each attribute is made up of metadata items which describe that
   attribute, its value and any associated access controls.  Metadata
   items may be either read-only in which case the client is never
   permitted to modify the item, or read-write, in which case the client
   may modify the item if the access control list (ACL) permits.

   The following metadata items are defined in this specification:

   acl    The access control list for the attribute, if one exists.  If
          the attribute does not have an ACL, NIL is returned.
          Read-write.  See section ### for the contents of an ACL.

   attribute
          The attribute name.  Read-only.

   myrights
          The set of rights that the client has to the attribute.
          Read-only.  See section ### for the possible rights.

   size   This is the length of the value.  In the case of a






Newman                                                         [Page 14]

Internet DRAFT                    ACAP                     June 19, 1997


          multi-value, this is a list of lengths for each of the values.

   value  The value.  For a multi-value, this is a list of single
          values.

   Additional items of metadata may be defined in extensions to this
   protocol.  Servers MUST respond to queries of unrecognized metadata
   by returning a BAD command completion result.

3.2.     ACAP URL scheme

   ACAP URLs are used within the ACAP protocol for the "subdataset"
   attribute, referrals and inheritance.  They provide a convenient
   syntax for referring to other ACAP datasets.  The ACAP URL follows
   the common Internet scheme syntax as defined in [BASIC-URL].  If
   :<port> is omitted, the port defaults to 674.

   An ACAP URL has the following general form:

   url-acap  = "acap://" url-server "/" url-enc-entry [url-filter]

   The <url-server> element includes the hostname, and optional user
   name, authentication mechanism and port number.  The <url-enc-entry>
   element contains the name of an entry path encoded according to the
   rules in [BASIC-URL].

   The <url-filter> element is an optional list of interesting attribute
   names.  If omitted, the URL refers to all attributes of the named
   entry.

   Note that unsafe or reserved characters such as " " or "?" MUST be
   hex encoded as described in the URL specification [BASIC-URL].  Hex
   encoded octets are interpreted according to UTF-8 [UTF8].

3.2.1.   ACAP URL User Name and Authentication Mechanism

   A user name and/or authentication mechanism may be supplied.  They
   are used in the "AUTHENTICATE" command after making the connection to
   the ACAP server.  If no user name or authentication mechanism is
   supplied, then the SASL ANONYMOUS [SASL-ANON] mechanism is used by
   default.  If the URL supplies just a user name, the program
   interpreting the ACAP URL SHOULD request a password from the user if
   necessary.

   An authentication mechanism can be expressed by adding
   ";AUTH=<enc_auth_type>" to the end of the user name.  When such an
   <enc_auth_type> is indicated, the client SHOULD request appropriate
   credentials from that mechanism and use the "AUTHENTICATE" command.



Newman                                                         [Page 15]

Internet DRAFT                    ACAP                     June 19, 1997


   If no user name is specified, one SHOULD be obtained from the
   mechanism or requested from the user as appropriate.

   The string ";AUTH=*" indicates that the client SHOULD select an
   appropriate authentication mechanism.  It MAY use any mechanism
   listed in the initial ACAP response.  If no user name is specified
   and no appropriate authentication mechanisms are available, the
   client SHOULD fall back to anonymous login as described above.  This
   allows a URL which grants read-write access to authorized users, and
   read-only anonymous access to other users.

   Note that if unsafe or reserved characters such as " " or ";" are
   present in the user name or authentication mechanism, they MUST be
   encoded as described in the URL specification [BASIC-URL].

3.2.2.   Relative ACAP URLs

   Because ACAP uses "/" as the hierarchy separator for dataset paths,
   it works well with the relative URL rules defined in the relative URL
   specification [REL-URL].

   The <aauth> grammar element is considered part of the user name for
   purposes of resolving relative ACAP URLs.

   The base URL for a relative URL stored in an attribute's value is
   formed by taking the path to the dataset containing that attribute,
   appending a "/" followed by the entry name of the entry containing
   that attribute followed by "/".

3.3.     Contexts

   A context is subset of entries in a dataset or datasets, created by a
   SEARCH command with a MAKECONTEXT modifier.  Context names are
   client-generated strings and must not start with the slash ('/')
   character.

   When a client creates a context, it may request automatic
   notification of changes.  A client may also request enumeration of
   entries within a context.  Enumeration simplifies the implementation
   of a "virtual scrollbar" by the client.

   A context exists only within the ACAP session it was created.  When
   the connection is closed, all contexts associated with that
   connection are automatically discarded.  A server is required to
   support at least 100 active contexts within a session.  If the server
   supports a larger limit it must advertise it in a CONTEXTLIMIT
   capability.




Newman                                                         [Page 16]

Internet DRAFT                    ACAP                     June 19, 1997


3.4.     Comparators

   A comparator is a named function which takes two input values and can
   be used to perform one or more of three comparison operations:
   ordering, equality and substring matching.

   The ordering operation is used both for the SORT search modifier and
   the COMPARE and COMPARESTRICT search keys.  Ordering comparators can
   determine the ordinal precedence of any two values.  When used for
   ordering, a comparator's name can be prefixed with "+" or "-" to
   indicate that the ordering should be normal order or reversed order
   respectively.  If no prefix is included, "+" is assumed.

   For the purpose of ordering, a comparator may designate certain
   values as having an undefined ordinal precedence.  Such values always
   collate with equal value after all other values regardless of whether
   normal or reversed ordering is used.  Unless the comparator
   definition specifies otherwise, multi-values and NIL values have an
   undefined ordinal precedence.

   The equality operation is used for the EQUAL search modifier, and
   simply determines if the two values are considered equal under the
   comparator function.  When comparing a single value to a multi-value,
   the two are considered equal if any one of the multiple values is
   equal to the single value.

   The substring match operation is used for the PREFIX and SUBSTRING
   search modifiers, and simply determines if search value is a prefix
   or a substring of the item being searched.  In the case of substring
   search on a multi-valued attribute, the match is successful if the
   value is a prefix or substring of any one of the multiple values.

   Additional comparators may be registered with the Internet Assigned
   Number Authority (IANA) according to the rules in section ###.
   Servers MUST respond to unknown or improperly used comparators with a
   BAD command completion result.

   The following comparators are defined by this standard:

      octet
           Operations: Ordering, Equality, Substring match

           For collation, the octet comparator interprets the value of
           an attribute as a series of unsigned octets with ordinal
           values from 0 to 255.  When ordering two strings, each octet
           pair is compared in sequence until the octets are unequal or
           the end of the string is reached.  When collating two strings
           where the shorter is a prefix of the longer, the shorter



Newman                                                         [Page 17]

Internet DRAFT                    ACAP                     June 19, 1997


           string is interpreted as having a smaller ordinal value.  The
           "octet" or "+octet" forms collate smaller ordinal values
           earlier, and the "-octet" form collates larger ordinal values
           earlier.

           For the equality function, two strings are equal if they are
           the same length and contain the same octets in the same
           order.  NIL is equal only to itself.

           For non-binary, non-nil single values, octet ordering is
           equivalent to the ANSI C [ISO-C] strcmp() function applied to
           C string representations of the values.  For non-binary,
           non-nil single values, octet substring match is equivalent to
           the ANSI C strstr() function applied to the C string
           representations of the values.

      en-nocase
           Operations: Ordering, Equality, Substring match

           The en-nocase comparator first applies a mapping to the
           attribute values which translates all US-ASCII letters to
           uppercase (octet values 0x61 to 0x7A are translated to octet
           values 0x41 to 0x5A respectively), then applies the octet
           comparator as described above.  With this function the values
           "hello" and "HELLO" have the same ordinal value and are
           considered equal.

      numeric
           Operations: Ordering, Equality

           The numeric comparator interprets strings as decimal positive
           integers represented as US-ASCII digits.  All values which do
           not begin with a US-ASCII digit are considered equal with an
           ordinal value higher than all non-NIL single-valued
           attributes.  Otherwise, all US-ASCII digits (octet values
           0x30 to 0x39) are interpreted starting from the beginning of
           the string to the first non-digit or the end of the string.


3.5.     Access Control Lists (ACLs)

   An access control list is a set of identifier,rights pairs used to
   restrict access to a given dataset, attribute or attribute within an
   entry.  An ACL is represented by a multi-value with each value
   containing the identifier followed by a tab character followed by the
   rights.  The syntax is defined by the "acl" rule in the formal syntax
   in section ###.




Newman                                                         [Page 18]

Internet DRAFT                    ACAP                     June 19, 1997


   Identifier is a UTF-8 string.  The identifier "anyone" is reserved to
   refer to the universal identity (all authentications, including
   anonymous).  All user name strings accepted by the AUTHENTICATE
   command to authenticate to the ACAP server are reserved as
   identifiers for the corresponding user.  Identifiers starting with a
   dash ("-") are reserved for "negative rights", described below.  All
   other identifier strings have implementation-defined meanings.

   Rights is a string listing a (possibly empty) set of alphanumeric
   characters, each character listing a set of operations which is being
   controlled.  Letters are reserved for "standard" rights, listed
   below.  The set of standard rights may only be extended by a
   standards-track or IESG approved experimental RFC.  Digits are
   reserved for implementation or site defined rights.  The currently
   defined standard rights are:

   r - read
   w - write
   i - insert (perform store on a previously NIL value)
   a - administer (perform store on ACL attribute/metadata)

   An implementation may force rights to always or never be granted.  In
   particular, implementations are expected to grant implicit read and
   administer rights to a user's personal dataset storage in order to
   avoid denial of service problems.  Rights are never tied, unlike the
   IMAP ACL extension [IMAP-ACL].

   It is possible for multiple identifiers in an access control list to
   apply to a given user (or other authentication identity).  For
   example, an ACL may include rights to be granted to the identifier
   matching the user, one or more implementation-defined identifiers
   matching groups which include the user, and/or the identifier
   "anyone".  How these rights are combined to determine the user's
   access is implementation-defined.  An implementation may choose, for
   example, to use the union of the rights granted to the applicable
   identifiers.  An implementation may instead choose, for example, to
   only use those rights granted to the most specific identifier present
   in the ACL.  A client may determine the set of rights granted to the
   logged-in user for a given mailbox by using the MYRIGHTS command.

   When an identifier in an ACL starts with a dash ("-"), that indicates
   that associated rights are to be removed from the identifier that is
   prefixed by the dash.  For example, if the identifier "-fred" is
   granted the "w" right, that indicates that the "w" right is to be
   removed from users matching the identifier "fred".  Implementations
   need not support having identifiers which start with a dash in ACLs.

   Each attribute of each entry of a dataset may potentially have an



Newman                                                         [Page 19]

Internet DRAFT                    ACAP                     June 19, 1997


   ACL.  If an attribute in an entry does not have an ACL, then access
   is controlled by a default ACL for that attribute in the dataset, if
   it exists.  If there is no default ACL for that attribute in the
   dataset, access is controlled by a default ACL for that dataset.  The
   default ACL for a dataset must exist.

   In order to perform any access or manipulation on an entry in a
   dataset, the client must have 'r' rights on the "entry" attribute of
   the entry.  Implementations should take care not to reveal via error
   messages the existence of an entry for which the client does not have
   attribute of the parent dataset in order to access the contents of a
   dataset.

   Many of the ACL commands and responses include an "acl object"
   parameter, for specifying what the ACL applies to.  This is a
   parenthesized list.  The list contains just the dataset name when
   referring to the default ACL for a dataset.  The list contains a
   dataset name and an attribute name when referring to the default ACL
   for an attribute in a dataset.  The list contains a dataset name, an
   attribute name, and an entry name when referring to the ACL for an
   attribute of an entry of a dataset.


3.6.     Server Response Codes

   An OK, NO, BAD, ALERT or BYE response from the server MAY contain a
   response code to describe the event in a more detailed machine
   parsable fashion.  A response code consists of data inside
   parentheses in the form of an atom, possibly followed by a space and
   arguments.  Response codes are defined when there is a specific
   action that a client can take based upon the additional information.

   The currently defined response codes are:

      ENCRYPT-NEEDED
           This response code is returned on a tagged NO result from an
           AUTHENTICATE command.  It indicates that site security policy
           requires the use of a strong encryption mechanism for the
           specified authentication identity.

      INVALID
           This response code indicates that a STORE command included
           data which the server implementation does not permit.  It
           MUST NOT be used unless the dataset class specification for
           the attribute in question explicitly permits enforced server






Newman                                                         [Page 20]

Internet DRAFT                    ACAP                     June 19, 1997


           validation.  The argument is the attribute which was invalid.

      MODIFIED
           This response code indicates that a conditional store failed
           because the modtime on the entry is later than the modtime
           specified with the STORE command UNCHANGEDSINCE modifier.
           The argument is the entry which had been modified.

      NOEXIST
           This response code indicates that a search or NOCREATE store
           failed because a specified dataset did not exist.  The
           argument is the dataset which does not exist.

      PERMISSION
           A command failed due to insufficient permission based on the
           access control list or implicit rights.  The argument is the
           acl-object which caused the permission failure.

      PLAINTEXT-DENIED
           This response code is returned on a tagged NO result from an
           AUTHENTICATE PLAIN command.  It indicates that site security
           policy forbids the use of plain text passwords for the
           specified authentication identity.

      QUOTA
           A STORE command which would have increased the size of the
           dataset failed due to insufficient quota.

      REFER
           This response code may be returned in a tagged NO response to
           any command that takes a dataset name as a parameter.  It has
           one or more arguments with the syntax of relative URLs.  It
           is a referral, indicating that the command should be retried
           using one of the relative URLs.

      TOOMANY
           This response code may be returned in a tagged OK response to
           a SEARCH command which includes the LIMIT modifier.  The
           argument returns the total number of matching entries.

      TRANSITION-NEEDED
           This response code occurs on a NO response to an AUTHENTICATE
           command with a mechanism other than PLAIN or ANONYMOUS.  It
           indicates that the PLAIN SASL [SASL-PLAIN] mechanism is
           needed prior to using the stronger mechanism requested.

      TRYCACHE
           A STORE or SETACL command failed due to a temporary server



Newman                                                         [Page 21]

Internet DRAFT                    ACAP                     June 19, 1997


           failure.  If the client caches the command, it may succeed
           during a later cache replay.

      TRYFREECONTEXT
           This response code may be returned in a tagged NO response to
           a SEARCH command which includes the MAKECONTEXT modifier.  It
           indicates that a new context may not be created due to the
           server's limit on the number of existing contexts.

      WAYTOOMANY
           This response code may be returned in a tagged NO response to
           a SEARCH command which includes a HARDLIMIT search modifier.
           It indicates that the SEARCH would have returned more entries
           than the HARDLIMIT permitted.

      Additional response codes MUST be registered with IANA according
      to the proceedures in section ###.  Client implementations MUST
      ignore response codes that they do not recognize.

4.       Namespace Conventions

4.1.     Dataset Namespace

   The dataset namespace is a slash-separated hierarchy.  The first
   component of the dataset namespace is a dataset class.  Dataset
   classes MUST have a vendor prefix (vendor.<vendor/product>) or be
   standards track or IESG approved experimental RFCs.  See section ###
   for the registration template.

   The second component of the dataset name is "site", "group", "host",
   or "user" referring to server-wide data, administrative group data,
   per-host data and per-user data respectively.

   For "group", "host", and "user" areas, the third component of the
   path is the group name, the fully qualified host domain name, or the
   user name.  A path of the form "/<dataset-class>/~/" is a convenient
   abbreviation for "/<dataset-class>/user/<current-user>/".

   Dataset names which begin with "/byowner/" are reserved as an
   alternate view of the namespace.  This provides a way to see all the
   dataset classes which a particular owner uses.  For example,
   "/byowner/~/<dataset-class>/" is an alternate name for "/<dataset-
   class>/~/".  Byowner provides a way to view a list of dataset classes
   owned by a given user; this is done using the dataset
   "/byowner/user/<current-user>/" with the NOINHERIT SEARCH modifier.

   The dataset "/" may be used to find all dataset classes visible to
   the current user.  A dataset of the form "/<dataset-class>/user/" may



Newman                                                         [Page 22]

Internet DRAFT                    ACAP                     June 19, 1997


   be used to find all users which have made a dataset or entry of that
   class visible to the current user.

   The formal syntax for a dataset name is defined by the "dataset-name"
   terminal in section ###.

4.2.     Attribute Namespace

   Attribute names which do not contain a dot (".") are reserved for
   standardized attributes which have meaning in any dataset.  In order
   to simplify implementations, the attribute namespace is intended to
   be unique across all datasets.  To achieve this, attribute names are
   prefixed with the dataset class name followed by a dot (".").
   Attributes which effect management of the dataset are prefixed with
   "dataset.".  In addition, a subtree of the "vendor." attribute
   namespace may be registered with IANA according to the rules in
   section ###.  ACAP implementors are encouraged to help define
   interoperable dataset classes specifications rather than using the
   private attribute namespace.

   Finally, the "user.<user-name>." and "site." subtrees of the
   attribute namespace are reserved for user-specific and site-specific
   attributes respectively.  Such attributes are not interoperable so
   are discouraged in favor of defining standard attributes. A future
   extension is expected to permit discovery of syntax for user or
   site-specific attributes.  Clients wishing to support display of user
   or site-specific attributes should display the value of any non-NIL
   single-valued "user.<user-name>." or "site." attribute which has
   valid UTF-8 syntax.

   The formal syntax for an attribute name is defined by the
   "attribute-name" terminal in the next section.

4.3.     Formal Syntax for Dataset and Attribute Namespace

   The naming conventions for datasets and attributes are defined by the
   following ABNF.   Note that this grammar is not part of the ACAP
   protocol syntax in section ###, as dataset names and attribute names
   are encoded as strings within the ACAP protocol.

   attribute-dacl  = "dataset.acl" *("." name-component)

   attribute-dset  = dataset-std 1*("." name-component)
                     ;; MUST be defined in a dataset class specification

   attribute-name  = attribute-std / attr-site / attr-user / vendor-name





Newman                                                         [Page 23]

Internet DRAFT                    ACAP                     June 19, 1997


   attribute-std   = "entry" / "subdataset" / "modtime" / "dataset.inherit"
                     / attribute-dacl / attribute-dset

   attr-site       = "site" 1*("." name-component)

   attr-user       = "user." name-component 1*("." name-component)

   byowner         = "/byowner/" owner "/" [dataset-class "/" dataset-sub]

   dataset-class   = dataset-std / vendor-name

   dataset-normal  = "/" [dataset-class "/" (owner-prefix / dataset-tail)]

   dataset-name    = byowner / dataset-normal

   dataset-std     = name-component
                     ;; MUST be registered with IANA and the spec MUST
                     ;; be published as a standards track or
                     ;; IESG-approved experimental RFC

   dataset-sub     = *(dname-component "/")
                     ;; The rules for this portion of the namespace may
                     ;; be further restricted by the dataset class
                     ;; specification.

   dataset-tail    = owner "/" dataset-sub

   dname-component = 1*UTF8-CHAR
                     ;; MUST NOT begin with "." or contain "/"

   name-component  = 1*UTF8-CHAR
                     ;; MUST NOT contain ".", "/", "%", or "*"

   owner           = "site" / owner-host / owner-group / owner-user / "~"

   owner-group     = "group/" dname-component

   owner-host      = "host/" dname-component

   owner-prefix    = "group/" / "host/" / "user/"

   owner-user      = "user/" dname-component

   vendor-name     = vendor-token *("." name-component)

   vendor-token    = "vendor." name-component
                     ;; MUST be registered with IANA




Newman                                                         [Page 24]

Internet DRAFT                    ACAP                     June 19, 1997


5.       Dataset Management

   The entry with an empty name ("") in the dataset is used to hold
   management information for the dataset as a whole.

5.1.     Dataset Inheritance

   It is possible for one dataset to inherit data from another.  The
   dataset from which the data is inherited is called the base dataset.
   Data in the base dataset appears in the inheriting dataset, except
   where overridden by data in the inheriting dataset.

   The base dataset is usually a system-wide or group-wide set of
   defaults.  A system-wide dataset usually has one inheriting dataset
   per user, allowing each user to add to or modify the defaults as
   appropriate.

   An entry which exists in both the inheriting and inherited dataset
   has a modtime equal to the greater of the modtimes for the purposes
   of a SEARCH command and context notification.  Inheritance has no
   effect on the STORE command, except that if NIL is stored to an
   attribute and there is a default value in a base dataset, then an
   ENTRY response is returned to notify the client of the change.

   The "subdataset" attribute is not directly inherited.  If the base
   dataset includes a "subdataset" attribute and the inheriting dataset
   does not, then the "subdataset" attribute will inherit a virtual
   value of a list containing a ".".  The subdataset at that node is
   said to be a "virtual" dataset as it is simply a virtual copy of the
   appropriate base dataset with all "subdataset" attributes changed to
   a list containing a ".".  A virtual dataset is not visible if
   NOINHERIT is specified on the SEARCH command.

   Servers MUST support at least two levels of inheritance.  This
   permits a user's dataset such as "/options/user/fred/common" to
   inherit from a group dataset such as "/options/group/dinosaur
   operators/common" which in turn inherits from a server-wide dataset
   such as "/options/site/common".

5.2.     Dataset Attributes

   The following attributes apply to management of the dataset when
   stored in the "" entry of a dataset.  These attributes are not
   inherited.







Newman                                                         [Page 25]

Internet DRAFT                    ACAP                     June 19, 1997


   dataset.acl
        This holds the default access control list for the dataset.  It
        can not be modified by the STORE command, only by the SETACL and
        DELETEACL commands.

   dataset.acl.<attribute>
        This holds the default access control list for an attribute
        within the dataset. It can not be modified by the STORE command,
        only by the SETACL and DELETEACL commands.

   dataset.inherit
        This holds the name of a dataset to inherit according to the
        rules in section ###.  This attribute may refer to a non-
        existent dataset, in which case nothing is inherited.


5.3.     Dataset Creation

   When a dataset is first created (by storing a "." in the subdataset
   attribute or storing an entry in a previously non-existent dataset),
   the dataset attributes are initialized with the values from the
   parent dataset in the "/byowner/" hierarchy.  In the case of the
   "dataset.inherit" attribute, the appropriate hierarchy component is
   added.  For example, given the following entry:

   entry path        "/byowner/user/joe/"
   dataset.acl       ("joe" "rwia")
   dataset.inherit   "/byowner/site"

   If a new dataset class "/byowner/~/new" is created, it will have the
   following dataset attributes:

   entry path        "/byowner/user/joe/new/"
   dataset.acl       ("joe" "rwia")
   dataset.inherit   "/byowner/site/new"

   Note that the dataset "/byowner/user/joe/new/" is equivalent to
   "/new/user/joe/".

5.4.     Dataset Class Capabilities

   Certain dataset classes or dataset class features may only be useful
   if there is an active updating client or integrated server support
   for the feature.  The dataset class "capability" is reserved to allow
   clients or servers to advertise such features.  The "entry" attribute
   within this dataset class is the name of the dataset class whose
   features are being described.  The attributes are prefixed with
   "capability.<dataset-class>." and are defined by the appropriate



Newman                                                         [Page 26]

Internet DRAFT                    ACAP                     June 19, 1997


   dataset class specification.

   Since it is possible for an unprivileged user to run an active client
   for himself, a per-user capability dataset is useful.  The dataset
   "/capability/~/" holds information about all features available to
   the user (via inheritance), and the dataset "/capability/site/" holds
   information about all features supported by the site.

5.5.     Dataset Quotas

   The dataset class "quota" is reserved for quota management.  Each
   node of the "/byowner" view of the ACAP namespace MAY have an
   associated entry in the quota dataset class. A quota root is a quota
   limit and usage listed in the "quota" dataset class which applies to
   a sub-tree of the ACAP "/byowner" name-space exempting all parts of
   that sub-tree with their own quota root.

   A quota limit specifies the total number of bytes a sub-tree of the
   ACAP name-space may consume exempting all parts of that sub-tree with
   their own quota roots.  The actual number of bytes which a dataset or
   entry consumes is implementation dependent.  However two rules are
   necessary to promote interoperability:

   1) Removing an entry or dataset MUST reduce the quota usage.

   2) A STORE command MUST NOT fail with a quota error if for all entry
   modifications under a given quota root the sum of the lengths of the
   attribute names and values is less then the quota limit minus the
   quota usage.  For some implementations, it MAY be necessary to allow
   the quota usage to exceed the quota limit in order to satisfy this
   rule.  Note that a STORE command MAY succeed even if there does not
   appear to be enough space.

   The algorithm for locating a quota root for a dataset is as follows.
   First, if the dataset name does not begin with "/byowner", then the
   name is mapped appropriately.  Second, the "/byowner" is replaced
   with "/quota".  Third, any trailing "/" is removed.  If the resulting
   entry-path contains a "quota.limit" attribute, that is the quota
   root.  Otherwise, the last component of the entry path is removed,
   and the previous step is repeated.  The GETQUOTA command implements
   this algorithm in order to simplify ACAP clients.

   The quota dataset class itself is exempt from quota management.  ACAP
   implementations SHOULD apply a very restrictive default ACL to quota
   datasets.

   The creation of a new quota root SHOULD NOT be automatically linked
   to the creation of a dataset.  Quota roots MAY be completely



Newman                                                         [Page 27]

Internet DRAFT                    ACAP                     June 19, 1997


   independent, or MAY reduce the limit of their parent quota root on
   creation.  Quota roots SHOULD NOT be nested -- modifying data should
   only effect the usage within one quota root.  When a quota limit is
   removed (by storing NIL in quota.limit), its usage is added to the
   parent quota root, and its limit MAY be added to the parent quota
   root.

   The following attributes are defined within the quota dataset class:


   quota.limit
        This is single-valued.  The syntax for this value follows the
        "number" rule defined below.  This represents the quota limit,
        in bytes, as defined in section ###.

   quota.usage
        This is single-valued.  The syntax for this value follows the
        "number" rule defined below.  This is the quota usage in bytes.
        It MAY be greater than the quota limit.

   Because it can require excessive computation for some
   implementations, ACAP servers MAY respond with NO to a SEARCH command
   requesting context notification for the quota.usage attribute.

6.       Command and Response Specifications

   ACAP commands and responses are described in this section.  Commands
   are organized first by the state in which the command is permitted,
   then by a general category of command type.

   Command arguments, identified by "Arguments:" in the command
   descriptions below, are described by function, not by syntax.  The
   precise syntax of command arguments is described in the Formal Syntax
   section.

   Some commands cause specific server data to be returned; these are
   identified by "Data:" in the command descriptions below.  See the
   response descriptions in the Responses section for information on
   these responses, and the Formal Syntax section for the precise syntax
   of these responses.  It is possible for server data to be transmitted
   as a result of any command; thus, commands that do not specifically
   require server data specify "no specific data for this command"
   instead of "none".

   The "Result:" in the command description refers to the possible
   tagged status responses to a command, and any special interpretation
   of these status responses.




Newman                                                         [Page 28]

Internet DRAFT                    ACAP                     June 19, 1997


6.1.     Initial Connection

   Upon session startup, the server sends one of two untagged responses:
   ACAP or BYE.  The untagged BYE response is described in section ###.

6.1.1.   ACAP Untagged Response

   Data:       capability list

      The untagged ACAP response indicates the session is ready to
      accept commands and contains a space-separated listing of
      capabilities that the server supports.  Each capability is
      represented by a list containing the capability name optionally
      followed by capability specific string arguments.

      ACAP capability names MUST be defined in a standards track or IESG
      approved experimental RFC and registered with IANA according to
      the rules in section ###.

      Client implementations SHOULD NOT require any capability name, and
      MUST ignore any unknown capability names.

      The following initial capabilities are defined:

      COMPARATORS
           The COMPARATORS capability includes a list of the comparator
           functions which the server supports.  See section ### for a
           description of comparators.

      CONTEXTLIMIT
            The CONTEXTLIMIT capability has one argument which is a
            number describing the maximum number of contexts the server
            supports per connection.  The number 0 indicates the server
            has no limit, otherwise this number MUST be greater than
            100.

      IMPLEMENTATION
            The IMPLEMENTATION capability has one argument which is a
            string describing the server implementation.  ACAP clients
            MUST NOT alter their behavior based on this value.  It is
            intended primarily for debugging purposes.

      SASL  The SASL capability includes a list of the authentication
            mechanisms supported by the server.  See section ###.


   Example:    S: * ACAP (IMPLEMENTATION "ACME v3.5")
                         (SASL "CRAM-MD5" "PLAIN") (CONTEXTLIMIT "200")



Newman                                                         [Page 29]

Internet DRAFT                    ACAP                     June 19, 1997


6.2.     Any State

   The following commands and responses are valid in any state.


6.2.1.   NOOP Command

   Arguments:  none

   Data:       no specific data for this command (but see below)

   Result:     OK - noop completed
               BAD - command unknown or arguments invalid

      The NOOP command always succeeds.  It does nothing.  It can be
      used to reset any inactivity auto-logout timer on the server.

   Example:    C: a002 NOOP
               S: a002 OK "NOOP completed"


6.2.2.   LANG Command

   Arguments:  optional list of language preferences

   Data:       untagged response: LANG

   Result:     OK - lang completed
               NO - no matching language available
               BAD - command unknown or arguments invalid

      The LANG command with no arguments generates an untagged LANG
      response including a list of languages which the server supports
      for localized error text strings.  If one or more arguments are
      supplied they indicate the client's preferred languages for error
      messages.  The server will match each client preference in order
      against its internal table of available error strings languages.
      For a client preference to match a server language table, the
      client's language tag MUST be a prefix of the server's tag and
      match up to a "-" or the end of string.  If a match is found, the
      server returns an OK response.  If no match is found, the server
      returns an untagged LANG response followed by a NO response.

      If no LANG command is issued, all error text strings MUST be in
      English.  This rule is necessary because the default error text
      has to be in a language which is understandable by any pair of
      client and server vendors (since both have to diagnose problems).
      In addition, the default language for errors has to use the



Newman                                                         [Page 30]

Internet DRAFT                    ACAP                     June 19, 1997


      US-ASCII subset of UTF-8, since it can be displayed on the largest
      number of computers.

   Example:    C: A003 LANG "fr-ca" "fr" "en-ca" "en-uk"
               S: A003 OK "Bonjour"


6.2.3.   LANG Untagged Response

   Data:       list of supported language tags

      The LANG response indicates the languages supported for server
      error messages.

   Example:    C: N004 LANG
               S: * LANG "fr-ca" "en-ca"
               S: N004 OK "LANG completed"


6.2.4.   LOGOUT Command

   Arguments:  none

   Data:       mandatory untagged response: BYE

   Result:     OK - logout completed
               BAD - command unknown or arguments invalid

      The LOGOUT command informs the server that the client is done with
      the session.  The server must send a BYE untagged response before
      the (tagged) OK response, and then close the network connection.

   Example:    C: A023 LOGOUT
               S: * BYE "ACAP Server logging out"
               S: A023 OK "LOGOUT completed"
               (Server and client then close the connection)


6.2.5.   OK Response

   Data:       optional response code
               human-readable text

      The OK response indicates an information message from the server.
      When tagged, it indicates successful completion of the associated
      command.  The human-readable text may be presented to the user as
      an information message.  The untagged form indicates an
      information-only message; the nature of the information may be



Newman                                                         [Page 31]

Internet DRAFT                    ACAP                     June 19, 1997


      indicated by a response code.

   Example:    S: * OK "XXX - need good example"


6.2.6.   NO Response

   Data:       optional response code
               human-readable text

      The NO response indicates an operational error message from the
      server.  When tagged, it indicates unsuccessful completion of the
      associated command.  The untagged form indicates a warning; the
      command may still complete successfully.  The human-readable text
      describes the condition.

   Example:    C: A010 SEARCH ...
               S: * NO "Master ACAP server is down, your data may
                        be out of date."
               S: A010 OK "search done"
                  ...
               C: A222 STORE ("/folder/comp.mail.misc"
                              "folder.creation-time" "19951206103412")
               S: A222 NO (PERMISSION ("/folder/")) "Permission denied"


6.2.7.   BAD Response

   Data:       optional response code
               human-readable text

      The BAD response indicates an error message from the server.  When
      tagged, it reports a protocol-level error in the client's command;
      the tag indicates the command that caused the error.  The untagged
      form indicates a protocol-level error for which the associated
      command can not be determined; it may also indicate an internal
      server failure.  The human-readable text describes the condition.

   Example:    C: ...empty line...
               S: * BAD "Empty command line"
               C: A443 BLURDYBLOOP
               S: A443 BAD "Unknown command"
               C: A444 NOOP Hello
               S: A444 BAD "invalid arguments"







Newman                                                         [Page 32]

Internet DRAFT                    ACAP                     June 19, 1997


6.2.8.   BYE Untagged Response

   Data:       optional response code
               human-readable text

      The untagged BYE response indicates that the server is about to
      close the connection.  The human-readable text may be displayed to
      the user in a status report by the client.  The BYE response may
      be sent as part of a normal logout sequence, or as a panic
      shutdown announcement by the server.  It is also used by some
      server implementations as an announcement of an inactivity auto-
      logout.

      This response is also used as one of two possible greetings at
      session startup.  It indicates that the server is not willing to
      accept a session from this client.

   Example:    S: * BYE "Auto-logout; idle for too long"


6.2.9.   ALERT Untagged Response

   Data:       optional response code
               human-readable text

      The human-readable text contains a special human generated alert
      message that MUST be presented to the user in a fashion that calls
      the user's attention to the message.  This is intended to be used
      for vital messages from the server administrator to the user, such
      as a warning that the server will soon be shut down for
      maintenance.

   Example:    S: * ALERT "This ACAP server will be shut down in
                           10 minutes for system maintenance."


6.3.     Non-Authenticated State

   In non-authenticated state, the AUTHENTICATE command establishes
   authentication and enters authenticated state.  The AUTHENTICATE
   command provides a general mechanism for a variety of authentication
   techniques.

   Server implementations may allow non-authenticated access to certain
   information by supporting the SASL ANONYMOUS [SASL-ANON] mechanism.

   Once authenticated (including as anonymous), it is not possible to
   re-enter non-authenticated state.



Newman                                                         [Page 33]

Internet DRAFT                    ACAP                     June 19, 1997


   Only the any-state commands (NOOP, LANG and LOGOUT) and the
   AUTHENTICATE command are valid in non-authenticated state.


6.3.1.   AUTHENTICATE Command

   Arguments:  SASL mechanism name
               optional initial response

   Data:       continuation data may be requested

   Result:     OK - authenticate completed, now in authenticated state
               NO - authenticate failure: unsupported authentication
                    mechanism, credentials rejected
               BAD - command unknown or arguments invalid,
                    authentication exchange cancelled

      The AUTHENTICATE command indicates an authentication mechanism to
      the server.  If the server supports the requested authentication
      mechanism, it performs an authentication protocol exchange to
      authenticate and identify the user.  Optionally, it also
      negotiates a security layer for subsequent protocol interactions.
      If the requested authentication mechanism is not supported, the
      server rejects the AUTHENTICATE command by sending a tagged NO
      response.

      The authentication protocol exchange consists of a series of
      server challenges and client answers that are specific to the
      authentication mechanism.  A server challenge consists of a
      command continuation request with the "+" token followed by a
      BASE64 encoded string.  The client answer consists of a line
      consisting of a BASE64 encoded string.  If the client wishes to
      cancel an authentication exchange, it should issue a line with a
      single "*".  If the server receives such an answer, it must reject
      the AUTHENTICATE command by sending a tagged BAD response.

      The optional initial-response argument to the AUTHENTICATE command
      is used to save a round trip when using authentication mechanisms
      that are defined to send no data in the initial challenge.  When
      the initial-response argument is used with such a mechanism, the
      initial empty challenge is not sent to the client and the server
      uses the data in the initial-response argument as if it were sent
      in response to the empty challenge.  If the initial-response
      argument to the AUTHENTICATE  command is used with a mechanism
      that sends data in the initial challenge, the server rejects the
      AUTHENTICATE command by sending a tagged NO response.

      The service name specified by this protocol's profile of SASL is



Newman                                                         [Page 34]

Internet DRAFT                    ACAP                     June 19, 1997


      "acap".

      If a security layer is negotiated through the SASL authentication
      exchange, it takes effect immediately following the CRLF that
      concludes the authentication exchange for the client, and the CRLF
      of the tagged OK response for the server.

      All ACAP implementations MUST support the PLAIN SASL mechanism
      [SASL-PLAIN], although they MAY offer a configuration option to
      disable plaintext passwords if site security policy dictates.
      ACAP implementations SHOULD support an external encryption service
      or a stronger standards track SASL mechanism.

      If an AUTHENTICATE command fails with a NO response, the client
      may try another authentication mechanism by issuing another
      AUTHENTICATE command.  In other words, the client may request
      authentication types in decreasing order of preference.


   Example:    S: * ACAP (IMPLEMENTATION "Blorfysoft v3.5")
                         (SASL "PLAIN" "KERBEROS_V4")
               C: A001 AUTHENTICATE KERBEROS_V4
               S: + AmFYig==
               C: BAcAQU5EUkVXLkNNVS5FRFUAOCAsho84kLN3/IJmrMG+25a4DT
                  +nZImJjnTNHJUtxAA+o0KPKfHEcAFs9a3CL5Oebe/ydHJUwYFd
                  WwuQ1MWiy6IesKvjL5rL9WjXUb9MwT9bpObYLGOKi1Qh
               S: + or//EoAADZI=
               C: DiAF5A4gA+oOIALuBkAAmw==
               S: A001 OK "Kerberos V4 authentication successful"


6.4.     Searching

   This section describes the SEARCH command, for retrieving data from
   datasets.
















Newman                                                         [Page 35]

Internet DRAFT                    ACAP                     June 19, 1997


6.4.1.   SEARCH Command

   Arguments:  dataset or context name
               optional list of modifiers
               search criteria

   Data:       intermediate responses: ENTRY, MODTIME, REFER
               untagged responses: ADDTO, REMOVEFROM, CHANGE, MODTIME

   Result:     OK - search completed
               NO - search failure: can't perform search
               BAD - command unknown or arguments invalid

      The SEARCH command identifies a subset of entries in a dataset and
      returns information on that subset to the client.

      The first argument to SEARCH identifies what is to be searched.
      If the string begins with a slash ("/"), it is the name of a
      dataset to be searched, otherwise it is a name of a context that
      was created by a SEARCH command given previously in the session.

      A successful SEARCH command MUST result in a MODTIME intermediate
      response.

      Following that are zero or more modifiers to the search.  Each
      modifier may be specified at most once.  The defined modifiers
      are:

      DEPTH number
           The SEARCH command will traverse the dataset tree up to the
           specified depth.  ENTRY responses will include the full path
           to the entry.  A value of "0" indicates that the search
           should traverse the entire tree.  A value of "1" is the
           default and indicates only the specified dataset should be
           searched.  If a dataset is traversed which is not located on
           the current server, then a REFER intermediate response is
           returned for that subtree and the search continues.

      HARDLIMIT number
           If the SEARCH command would result in more than number
           entries, the SEARCH fails with a NO completion result with a
           WAYTOOMANY response code.

      LIMIT number number
           Limits the number of intermediate ENTRY responses that the
           search may generate.  The first numeric argument specifies
           the limit, the second number specifies the number of entries
           to return if the number of matches exceeds the limit.  If the



Newman                                                         [Page 36]

Internet DRAFT                    ACAP                     June 19, 1997


           limit is exceeded, the SEARCH command still succeeds,
           returning the total number of matches in a TOOMANY response
           code in the tagged OK response.

      MAKECONTEXT [ENUMERATE] [NOTIFY] context
           The SEARCH command creates a context with the name given in
           the argument to refer to the matching entries.  If the SEARCH
           is successful, the context name may then be given as an
           argument to subsequent SEARCH commands to search the set of
           matching entries. If a context with the specified name
           already exists, it is first freed.  If a new context may not
           be created due to the server's limit on the number of
           existing contexts, the command fails, returning a
           TRYFREECONTEXT response code in the NO completion response.

           The optional "ENUMERATE" and "NOTIFY" arguments may be
           included to request enumeration of the context (for virtual
           scroll bars) or change notifications for the context.

           ENUMERATE requests that the contents of the context be
           ordered according to the SORT modifier and that sequential
           numbers, starting with one, be assigned to the entries in the
           context.  This permits the RANGE modifier to be used to fetch
           portions of the ordered context.

           NOTIFY requests that the server send untagged ADDTO,
           REMOVEFROM, CHANGE, and MODTIME responses while the context
           created by this SEARCH command exists.  The server MAY issue
           untagged ADDTO, REMOVEFROM, CHANGE and MODTIME notifications
           for a context at any time between the issuing of the SEARCH
           command with MAKECONTEXT NOTIFY and the completion of a
           FREECONTEXT command for the context.  Notifications are only
           issued for changes which occur after the server receives the
           SEARCH command which created the context.  After issuing a
           sequence of ADDTO, REMOVEFROM or CHANGE notifications, the
           server MUST issue an untagged MODTIME notification indicating
           that the client has all updates to the entries in the context
           up to and including the given modtime value.  Servers are
           permitted a reasonable delay to batch change notifications
           before sending them to the client.

           The position arguments of the ADDTO, REMOVEFROM and CHANGE
           notifications are 0 if ENUMERATE is not requested.

      NOINHERIT
           This causes the SEARCH command to operate without
           inheritance.  It can be used to tell which values are
           explicit overrides.  If MAKECONTEXT is also specified, the



Newman                                                         [Page 37]

Internet DRAFT                    ACAP                     June 19, 1997


           created context is also not effected by inheritance.

      RETURN (metadata...)
           Specifies what is to be returned in intermediate ENTRY
           responses.  If this modifier is not specified, no
           intermediate ENTRY responses are returned.

           Inside the parentheses is a list of attributes, each
           optionally followed by a parenthesized list of metadata.  If
           the parenthesized list of metadata is not specified, it
           defaults to "(value)".

           An attribute name with a trailing "*" requests all attributes
           with that prefix.  A "*" by itself requests all attributes.
           If the parenthesized list of metadata is not specified for an
           attribute with a trailing "*", it defaults to "(attribute
           value)".

           Following the last intermediate ENTRY response, the server
           returns a single intermediate MODTIME response.

      SORT (attribute comparator ...)
           Specifies the order in which any resulting ENTRY replies are
           to be returned to the client.  The SORT modifier takes as an
           argument a parenthesized list of one or more
           attribute/comparator pairs.  Attribute lists the attribute to
           sort on, comparator specifies the name of the collation rule
           to apply to the values of the attribute.  Successive
           attribute/comparator pairs are used to order two entries only
           when all preceding pairs indicate the two entries collate the
           same.

           If the SORT modifier is used in conjunction with the
           MAKECONTEXT modifier, the SORT modifier specifies the
           ordering of entries in the created context.

           If no SORT modifier is specified, or none of the
           attribute/comparator pairs indicates an order for the two
           entries, the server uses the order of the entries that exists
           in the context or dataset being searched.


      Following the modifiers is the search criteria.  Searching
      criteria consist of one or more search keys.  Search keys may be
      combined using the AND, and OR search keys.  For example, the
      criteria (the newline is for readability and not part of the
      criteria):




Newman                                                         [Page 38]

Internet DRAFT                    ACAP                     June 19, 1997


          AND COMPARE "modtime" "+octet" "19951206103400"
              COMPARE "modtime" "-octet" "19960112000000"
      refers to all entries modified between 10:34 December 6 1995 and
      midnight January 12, 1996 UTC.

      The currently defined search keys are as follows.

      ALL  This matches all entries.

      AND search-key1 search-key2
           Entries that match both search keys.

      COMPARE attribute comparator value
           Entries for which the value of the specified attribute
           collates using the specified comparator the same or later
           than the specified value.

      COMPARESTRICT attribute comparator value
           Entries for which the specified attribute collates using the
           specified comparator later than the specified value.

      EQUAL attribute comparator value
           Entries for which the value of the attribute is equal to the
           specified value using the specified comparator.

      NOT search-key
           Entries that do not match the specified search key.

      OR search-key1 search-key2
           Entries that match either search key.

      PREFIX attribute comparator value
           Entries which begin with the specified value using the
           specified comparator.  If the specified comparator doesn't
           support substring matching, a BAD response is returned.

      RANGE start end time
           Entries which are within the specified range of the
           enumerated context's ordering.  The lowest-ordered entry in
           the context is assigned number one, the next lowest entry is
           assigned number two, and so on.  The numeric arguments
           specify the lowest and highest numbers to match. The time
           specifies that the client has processed notifications for the
           context up to the specified time.  If the context has been
           modified since then, the server MUST either return a NO with
           a MODIFIED response code, or return the results that the
           SEARCH would have returned if none of the changes since that
           time had been made.



Newman                                                         [Page 39]

Internet DRAFT                    ACAP                     June 19, 1997


           RANGE is only permitted on contexts.  If RANGE is used with a
           dataset, the server MUST return a BAD response.

      SUBSTRING attribute comparator value
           Entries which contain the specified value, using the
           specified comparator.  If the specified comparator doesn't
           support substring matching, a BAD response is returned.


   Example:    C: [TODO - write examples]


6.4.2.   ENTRY Intermediate Response

   Data:       entry name
               entry data

      The ENTRY intermediate response occurs as a result of a SEARCH
      command.  This is the means by which dataset entries are returned
      to the client.  The entry with the given name matches the search.
      Following the entry name is a set of zero or more lists, one for
      each item in the RETURN search modifier, each containing the
      requested metadata for the requested attribute(s) within the
      entry.

6.4.3.   MODTIME Intermediate Response

   Data:       modtime value

      The MODTIME intermediate response occurs as a result of a SEARCH
      command.  It indicates that the just created context or the
      previously returned ENTRY responses include all updates to the
      returned entries up to and including the modtime value in the
      argument.


6.4.4.   REFER Intermediate Response

   Data:       dataset path
               ACAP URL

      The REFER intermediate response occurs as a result of a
      multi-level SEARCH where one of the levels is located on a
      different server.  The response indicates the dataset which is not
      located on the current server and an ACAP URL for where that
      dataset may be found.





Newman                                                         [Page 40]

Internet DRAFT                    ACAP                     June 19, 1997


6.5.     Contexts

   The following commands use contexts created by a SEARCH command with
   a MAKECONTEXT modifier.


6.5.1.   FREECONTEXT Command

   Arguments:  context name

   Data:       no specific data for this command

   Result:     OK - freecontext completed
               NO - freecontext failure: no such context
               BAD - command unknown or arguments invalid

      The FREECONTEXT command causes the server to free all state
      associated with the named context.  The context may no longer be
      searched and the server will no longer issue any untagged
      responses for the context.  The context is no longer counted
      against the server's limit on the number of contexts.

   Example:    C: A683 FREECONTEXT "blurdybloop"
               S: A683 OK "Freecontext completed"


6.5.2.   UPDATECONTEXT Command

   Arguments:  list of context names

   Data:       untagged responses: ADDTO REMOVEFROM CHANGE MODTIME

   Result:     OK - Updatecontext completed: all updates completed
               NO - Updatecontext failed: no such context
                                          not a notify context
               BAD - command unknown or arguments invalid

      The UPDATECONTEXT command causes the server to ensure that the
      client is notified of all changes to the contexts listed as
      arguments up to the current time.  The contexts listed in the
      arguments must have been previously given to a successful SEARCH
      command with a MAKECONTEXT NOTIFY modifier.  A MODTIME untagged
      response MUST be returned if any read-write metadata in the
      context changed since the last MODTIME for that context.  This
      includes metadata which is not listed in the RETURN modifier for
      the context.

      While a server may issue untagged ADDTO, REMOVEFROM, CHANGE, and



Newman                                                         [Page 41]

Internet DRAFT                    ACAP                     June 19, 1997


      MODTIME at any time, the UPDATECONTEXT command is used to "prod"
      the server to send any notifications it has not sent yet.

      The UPDATECONTEXT command SHOULD NOT be used to poll for updates.
      If two or more UPDATECONTEXT commands occur between the delay
      period the server uses to generate unsolicited change
      notifications, then the server MAY treat all UPDATECONTEXT
      commands after the first as NOOP commands to discourage client
      polling.

   Example:    C: Z4S9 UPDATECONTEXT "blurdybloop" "blarfl"
               S: Z4S9 OK "client has been notified of all changes"


6.5.3.   ADDTO Untagged Response

   Data:       context name
               entry name
               position
               metadata list

      The untagged ADDTO response informs the client that an entry has
      been added to a context.  The response includes the position
      number of the added entry (the first entry in the context is
      numbered 1) and those metadata contained in the entry which match
      the RETURN statement when the context was created.

      The ADDTO response implicitly adds one to the position of all
      members of the context which had position numbers that were
      greater than or equal to the ADDTO position number.

   Example:    S: * ADDTO "blurdybloop" "fred" 15
                    ("addressbook.email" "fred@rock.org")


6.5.4.   REMOVEFROM Untagged Response

   Data:       context name
               entry name
               old position

      The untagged REMOVEFROM response informs the client that an entry
      has been removed from a context.  The response includes the
      position number that the removed entry used to have (the first
      entry in the context is numbered 1).

      The REMOVEFROM response implicitly subtracts one from the position
      numbers of all members of the context which had position numbers



Newman                                                         [Page 42]

Internet DRAFT                    ACAP                     June 19, 1997


      greater than the REMOVEFROM position number.

   Example:    S: * REMOVEFROM "blurdybloop" "fred" 15


6.5.5.   CHANGE Untagged Response

   Data:       context name
               entry name
               old position
               new position
               metadata list

      The untagged CHANGE response informs the client that an entry in a
      context has either changed position in the context or has changed
      the values of one or more of the attributes specified in the
      RETURN modifier when the context was created.

      The response includes the previous and current position numbers of
      the entry (if ENUMERATE was specified on the context) and the
      attribute metadata requested in the RETURN modifier when the
      context was created.

      The CHANGE response implicitly changes the position numbers of all
      entries which had position numbers between the old and new
      position.  If old position is less than new position, than one is
      subtracted from all entries which had position numbers in that
      range.  Otherwise one is added to all entries which had position
      numbers in that range.  If the old position and new position are
      the same, then no implicit position renumbering occurs.

      CHANGE responses are not issued for entries which have changed
      position implicitly due to another ADDTO, REMOVEFROM or CHANGE
      response.

   Example:    S: * CHANGE "blurdybloop" "fred" 15 10
                    ("addressbook.email" "fred@stone.org")


6.5.6.   MODTIME Untagged Response

   Data:       context name
               modtime value

      The untagged MODTIME response informs the client that it has
      received all updates to entries in the context which have modtime
      values less than or equal to the modtime value in the argument.




Newman                                                         [Page 43]

Internet DRAFT                    ACAP                     June 19, 1997


   Example:    S: * MODTIME mycontext "19970320162338"

6.6.     Dataset modification

   The following commands and responses handle modification of datasets.


6.6.1.   STORE Command

   Arguments:  entry store list

   Data:       intermediate responses: ENTRY

   Result:     OK - store completed
               NO - store failure: can't store that name
                    UNCHANGEDSINCE specified and entry changed
               BAD - command unknown or arguments invalid
                     invalid UTF-8 syntax in attribute name

      Creates, modifies or deletes the named entries in the named
      datasets.  The values of metadata not specified in the command are
      not changed.  Setting the "value" metadata of an attribute to NIL
      removes that attribute from the entry.  Setting the "value" of the
      "entry" attribute to NIL removes that entry from the dataset.
      Changing the value of the "entry" attribute renames the entry.

      The STORE command is followed by one or more entry store lists.
      Each entry store list begins with an entry path followed by STORE
      modifiers, followed by zero or more attribute store items.  Each
      attribute store item is made up of the attribute name followed by
      a NIL (to remove the attribute's value), a single value (to set
      the attribute's single value), or a list of metadata items to
      modify.  The following STORE modifiers may be specified:


      NOCREATE
           By default, the server MUST create any datasets necessary to
           store the entry.  If NOCREATE is specified, the STORE command
           will fail with a NOEXIST error unless the containing dataset
           already exists.

      UNCHANGEDSINCE
           If the "modtime" of the entry is later than the
           unchangedsince time, then the store fails with a MODIFIED
           response code.  Use of UNCHANGEDSINCE with a time of
           "00000101000000" will always fail if the entry exists.
           Clients writing to a shared dataset are encouraged to use
           UNCHANGEDSINCE when modifying an existing entry.



Newman                                                         [Page 44]

Internet DRAFT                    ACAP                     June 19, 1997


      The server MUST either make all the changes specified or make none
      of them.  If successful, the server MUST update the "modtime"
      attribute for every entry which was changed.

      It is illegal to list any metadata item within an attribute twice,
      any attribute within an entry twice or to any entry path twice.
      The server MUST return a BAD response if this happens.  If the
      "modtime" attribute is included in the STORE command, then the
      server MUST return a NO response with an ILLEGAL response code.

      When NIL is stored to an attribute, and there is an inherited
      default value, then an ENTRY intermediate response is generated to
      notify the client of this change, this response includes the
      attribute name and value metadata for each attribute which
      reverted to a non-NIL inherited setting.


   Example:    C: A342 STORE ("/addressbook/user/fred/ABC547"
                       "addressbook.phone" "555-1234"
                       "addressbook.CommonName" "Barney Rubble"
                       "addressbook.email" NIL)
               S: A342 OK "Store completed"
               C: A343 STORE ("/addressbook/user/joe/ABD42"
                       UNCHANGEDSINCE "19970320162338"
                       "user.joe.hair-length" "10 inches")
               S: A343 NO (MODIFIED) "'ABD42' has been changed
                       by somebody else."
               C: A344 STORE ("/addressbook/group/Tech/ACD54"
                       "entry" NIL)
               S: A344 OK "Store completed"
               C: A345 STORE ("/option/~/mail/SMTPserver" "value" NIL)
               S: A345 ENTRY "SMTPserver" "value" "smtp.server.do.main"
               S: A345 OK "Store completed"


6.6.2.   DELETEDSINCE Command

   Arguments:  dataset name
               time

   Data:       intermediate response: DELETED

   Result:     OK - DELETED completed
               NO - DELETED failure: can't read dataset
                    date too far in the past
               BAD - command unknown or arguments invalid

      The DELETEDSINCE command returns in intermediate DELETED replies



Newman                                                         [Page 45]

Internet DRAFT                    ACAP                     June 19, 1997


      the names of entries that have been deleted from the named dataset
      since the given time.

      Servers may impose a limit on the number or age of deleted entry
      names they keep track of.  If the server does not have information
      going back to the specified time, the command fails, returning a
      TOOOLD response code in the tagged NO response.

   Example:    C: Z4S9 DELETEDSINCE "/folder/site" 19951205103412
               S: Z4S9 DELETED "blurdybloop"
               S: Z4S9 DELETED "anteaters"
               S: Z4S9 OK "DELETEDSINCE completed"
               C: Z4U3 DELETEDSINCE "/folder/site" 19951009040854
               S: Z4U3 NO (TOOOLD) "Don't have that information"


6.6.3.   DELETED Intermediate Response

   Data:       entry name

      The intermediate DELETED response occurs as a result of a
      DELETEDSINCE command. It returns an entry that has been deleted
      from the dataset specified in the DELETEDSINCE command.

   Example:    S: Z4S9 DELETED "blurdybloop"

6.7.     Access Control List Commands

   The commands in this section are used to manage access control lists.


6.7.1.   SETACL Command

   Arguments:  acl object
               authentication identifier
               access rights

   Data:       no specific data for this command

   Result:     OK - setacl completed
               NO - setacl failure: can't set acl
               BAD - command unknown or arguments invalid

      The SETACL command changes the access control list on the
      specified object so that the specified identifier is granted the
      permissions enumerated in rights.  If the object did not
      previously have an access control list, one is created.




Newman                                                         [Page 46]

Internet DRAFT                    ACAP                     June 19, 1997


   Example:    C: A123 SETACL ("/addressbook/~/public/") "anyone" "r"
               S: A123 OK "Setacl complete"
               C: A124 SETACL ("/folder/site/") "B1FF" "rwa"
               S: A124 NO (PERMISSION ("/folder/site/")) "'B1FF' not
                       permitted to modify access rights
                       for '/folder/site/'"



6.7.2.   DELETEACL Command

   Arguments:  acl object
               optional authentication identifier

   Data:       no specific data for this command

   Result:     OK - deleteacl completed
               NO - deleteacl failure: can't delete acl
               BAD - command unknown or arguments invalid

      If given the optional identifier argument, the DELETEACL command
      removes any portion of the access control list on the specified
      object for the specified identifier.

      If not given the optional identifier argument, the DELETEACL
      command removes the ACL from the object entirely, causing access
      to be controlled by a higher-level default ACL.  This form of the
      DELETEACL command is not permitted on the default ACL for a
      dataset and servers MUST return a BAD.


   Example:    C: A223 DELETEACL ("/addressbook/~/public") "anyone"
               S: A223 OK "Deleteacl complete"
               C: A224 DELETEACL ("/folder/site")
               S: A224 BAD "Can't delete ACL from dataset"
               C: A225 DELETEACL ("/addressbook/user/fred"
                       "addressbook.email" "barney")
               S: A225 OK "Deleteacl complete"













Newman                                                         [Page 47]

Internet DRAFT                    ACAP                     June 19, 1997


6.7.3.   MYRIGHTS Command

   Arguments:  acl object

   Data:       intermediate responses: MYRIGHTS

   Result:     OK - myrights completed
               NO - myrights failure: can't get rights
               BAD - command unknown or arguments invalid

      The MYRIGHTS command returns the set of rights that the client has
      to the given dataset or dataset attribute.


   Example:    C: A003 MYRIGHTS ("/folder/site")
               S: A003 MYRIGHTS "r"
               S: A003 OK "Myrights complete"



6.7.4.   MYRIGHTS Intermediate Response

   Data:       rights

      The MYRIGHTS response occurs as a result of a MYRIGHTS command.
      The argument is the set of rights that the client has for the
      object referred to in the MYRIGHTS command.


6.7.5.   LISTRIGHTS Command

   Arguments:  acl object
               authentication identifier

   Data:       untagged responses: LISTRIGHTS

   Result:     OK - listrights completed
               NO - listrights failure: can't get rights list
               BAD - command unknown or arguments invalid

      The LISTRIGHTS command takes an object and an identifier and
      returns information about what rights may be granted to the
      identifier in the ACL for the object.

   Example:    C: a001 LISTRIGHTS ("/folder") "smith"
               S: a001 LISTRIGHTS "r" "w"
               S: a001 OK Listrights completed
               C: a005 LISTRIGHTS ("/folder/archive.imap") "anyone"



Newman                                                         [Page 48]

Internet DRAFT                    ACAP                     June 19, 1997


               S: a005 LISTRIGHTS "" "r" "w"
               S: a005 OK Listrights completed



6.7.6.   LISTRIGHTS Intermediate Response

   Data:       required rights
               list of optional rights

      The LISTRIGHTS response occurs as a result of a LISTRIGHTS
      command.  The first argument is a string containing the (possibly
      empty) set of rights the identifier will always be granted on the
      dataset or attribute.

      Following this are zero or more strings each containing a single
      right the identifier may be granted in the dataset or attribute.

      The same right MUST NOT be listed more than once in the LISTRIGHTS
      response.


6.8.     Quotas

   The section defines the commands and responses relating to quotas.


6.8.1.   GETQUOTA Command

   Arguments:  dataset

   Data:       untagged responses: QUOTA

   Result:     OK - Quota information returned
               NO - Quota failure: can't access resource limit
                                   no resource limit
               BAD - command unknown or arguments invalid

      The GETQUOTA command takes the name of a dataset, and returns in
      an untagged QUOTA response the name of the dataset, its quota
      root, the quota limit on that root and the quota usage within that
      root.

   Example:    C: A043 GETQUOTA "/option/user/fred/common"
               S: * QUOTA "/option/user/fred/common" "/quota/user/fred"
                    1048576 2475
               S: A043 OK "Getquota completed"




Newman                                                         [Page 49]

Internet DRAFT                    ACAP                     June 19, 1997


6.8.3.   QUOTA Untagged Response

   Data:       dataset
               quota root
               quota limit in bytes
               amount of quota limit used

      The QUOTA untagged response is generated as a result of a GETQUOTA
      command or MAY be generated by the server in response to a SEARCH
      or STORE command to warn about high usage of a quota.  It includes
      the name of the applicable dataset, the quota root, the quota
      limit in bytes and the quota usage.

6.9.     Extensions

   In order to simplify the process of extending the protocol, clients
   MUST ignore unknown server responses which meet the syntax of
   response-extend.  In addition, clients MUST ignore server response
   codes which meet the syntax of resp-code-ext.  Availability of new
   commands MUST be announced via a capability on the initial greeting
   line and such commands SHOULD meet the syntax of command-extend.

   Servers MUST respond to unknown commands with a BAD command
   completion result.  Servers MUST skip over non-synchronizing literals
   contained in an unknown command.  This may be done by assuming the
   unknown command matches the command-extend syntax, or by reading a
   line at a time and checking for the non-synchronizing literal syntax
   at the end of the line.

7.       Registration Procedures

   ACAP's usefulness comes from providing a structured storage model for
   all sorts of configuration data.  However, for its potential to be
   achieved, it is important that the Internet community strives for the
   following goals:

   (1) Standardization.  It is very important to standardize dataset
   classes.  The authors hope that ACAP achieves the success that SNMP
   has seen with the definition of numerous standards track MIBs.

   (2) Community Review.  In the absence of standardization, it is
   important to get community review on a proposal to improve its
   engineering quality.  Community review is strongly recommended prior
   to registration.  The ACAP implementors mailing list
   <ietf-acap@andrew.cmu.edu> should be used for this purpose.

   (3) Registration.  Registration serves a two-fold purpose.  First it
   prevents use of the same name for different purposes, and second it



Newman                                                         [Page 50]

Internet DRAFT                    ACAP                     June 19, 1997


   provides a one-stop list which can be used to locate existing
   extensions or dataset classes to prevent duplicate work.

   The following registration templates may be used to register ACAP
   protocol elements.

7.1.     Comparators

   Additional comparators may be registered with IANA on a first-come,
   first-served basis.  Comparators intended for interoperable use MUST
   be defined as a standards-track or IESG-approved-experimental RFC.

   To: XXX@XXX.XXX
   Subject: Registration of new comparator

   Comparator name:

   Scope:

   (Describe any limitations on intended use in terms of standards scope,
    dataset classes, and specific locales.)

   Operations: Ordering, Equality, Substring match

   Published Specification(s):

   (If the published specification is not standards track, or no
    published specification is referenced then the comparator is
    assumed to be for limited use.)

   Person and email address to contact for further information:

7.2.     ACAP Capabilities

   New ACAP capabilities MUST be standards track or IESG approved
   experimental RFCs.  Registration provides a simple way to locate all
   extensions.  Careful consideration should be made before extending
   the protocol, as it can lead to complexity or interoperability
   problems.

   To: XXX@XXX.XXX
   Subject: Registration of ACAP capability

   Capability name:

   Capability keyword:

   Capability arguments:



Newman                                                         [Page 51]

Internet DRAFT                    ACAP                     June 19, 1997


   Published Specification(s):

   (Standards track or IESG approved experimental RFC)

   Person and email address to contact for further information:

7.3.     ACAP Response Codes

   ACAP response codes are registered on a first come, first served
   basis.  Proposals SHOULD be reviewed by the acap implementors mailing
   list mentioned above.

   To: XXX@XXX.XXX
   Subject: Registration of ACAP response code

   Response Code:

   Arguments:

   Purpose:

   Published Specification(s):

   (Optional, but encouraged)

   Person and email address to contact for further information:

7.4.     Dataset Classes

   A dataset class provides a core set of attributes for use in a
   specified hierarchy.  It may also define rules for the dataset
   hierarchy underneath that class.  Dataset class specifications must
   be standards track or IESG approved experimental RFCs.

   To: XXX@XXX.XXX
   Subject: Registration of ACAP dataset class

   Dataset class name/attribute prefix:

   Purpose:

   Published Specification(s):

   (Standards track or IESG approved experimental RFC)

   Person and email address to contact for further information:





Newman                                                         [Page 52]

Internet DRAFT                    ACAP                     June 19, 1997


7.5.     Vendor Subtree

   Vendors may reserve a portion of the ACAP namespace for private use.
   Dataset class names beginning with "vendor.<company/product name>."
   are reserved for use by that company or product.  In addition, all
   attribute names beginning with "vendor.<company/product name>." are
   reserved for use by that company or product.  Registration is on a
   first come, first served basis.  Whenever possible, private
   attributes and dataset classes should be avoided in favor of
   improving interoperable dataset class definitions.

   To: XXX@XXX.XXX
   Subject: Registration of ACAP vendor subtree

   Private Prefix: vendor.<company/product name>.

   Person and email address to contact for further information:

   (company names and addresses should be included when appropriate)

8.       Formal Syntax

   The following syntax specification uses the augmented Backus-Naur
   Form (BNF) notation as specified in [ABNF].

   Except as noted otherwise, all alphabetic characters are
   case-insensitive.  The use of upper or lower case characters to
   define token strings is for editorial clarity only.  Implementations
   MUST accept these strings in a case-insensitive fashion.

   The "command" rule below defines the syntax for commands sent by the
   client.  The "response" rule below defines the syntax for responses
   sent by the server.

   ALPHA              = %x41..5A / %x61..7A
                        ;; alphabetic letters

   ATOM-CHAR          = "!" / %x23..27 / %x2A..5B / %x5D..7A / %x7C..7E
                        ;; Any CHAR except ATOM-SPECIALS

   ATOM-SPECIALS      = "(" / ")" / "{" / SPACE / CTL / QUOTED-SPECIALS

   BASE64-CHAR        = ALPHA / DIGIT / "+" / "/"
                        ;; case-sensitive

   CHAR               = %x01..7F

   CR                 = %x0C



Newman                                                         [Page 53]

Internet DRAFT                    ACAP                     June 19, 1997


   CRLF               = CR LF

   CTL                = %x00..1F / %x7F

   DIGIT              = "0" / DIGIT-NZ

   DIGIT-NZ           = %x31..39
                        ; non-zero digits ("1" - "9")

   LF                 = %x0A

   OCTET              = %x00..FF

   QUOTED-CHAR        = SAFE-UTF8-CHAR / "\" QUOTED-SPECIALS

   QUOTED-SPECIALS    = <"> / "\"

   SAFE-CHAR          = %x01..09 / %x0B..0C / %x0E..21 /
                        %x23..5B / %x5D..7F
                        ;; any TEXT-CHAR except QUOTED-SPECIALS

   SAFE-UTF8-CHAR     = SAFE-CHAR / UTF8-2 / UTF8-3 / UTF8-4 /
                        UTF8-5 / UTF8-6

   SPACE              = %x20

   TAG-CHAR           = %x21 / %x23..27 / %x2C..5B / %x5D..7A / %x7C..7E
                        ;; Any ATOM-CHAR except "*" or "+"

   TEXT-CHAR          = %x01..09 / %x0B..0C / %x0E..7F
                        ;; any CHAR except CR and LF

   TEXT-UTF8-CHAR     = SAFE-UTF8-CHAR / QUOTED-SPECIALS

   UTF8-1             = %x80..BF

   UTF8-2             = %xC0..DF UTF8-1

   UTF8-3             = %xE0..EF 2UTF8-1

   UTF8-4             = %xF0..F7 3UTF8-1

   UTF8-5             = %xF8..FB 4UTF8-1

   UTF8-6             = %xFC..FD 5UTF8-1

   UTF8-CHAR          = TEXT-UTF8-CHAR / CR / LF




Newman                                                         [Page 54]

Internet DRAFT                    ACAP                     June 19, 1997


   acl                = "(" *acl-identrights ")"

   acl-identifier     = string-utf8
                        ;; MUST NOT contain TAB

   acl-identrights    = string-utf8
                        ;; The identifier followed by a TAB, followed by
                        ;; the rights.

   acl-object         = "(" dataset [SPACE attribute [SPACE entry-name]] ")"

   acl-rights         = quoted

   atom               = ALPHA *1023ATOM-CHAR

   attribute          = string-utf8
                        ;; dot-separated attribute name
                        ;; MUST NOT contain "*" or "%"

   attribute-store    = attribute SPACE (value-nil /
                        "(" 1*(metadata-write-q SPACE value-store) ")")
                        ;; MUST NOT include the same metadata twice

   auth-type          = iana-token
                        ;; as defined in SASL [SASL]

   base64-token       = *(4BASE64-CHAR) [base64-terminal]

   base64-terminal    = (2BASE64-CHAR "==") / (3BASE64-CHAR "=")

   command            = tag SPACE (command-any / command-auth /
                        command-nonauth) CRLF
                        ;; Modal based on state

   command-authent    = "AUTHENTICATE" SPACE auth-type [SPACE base64-token]
                        *(CRLF base64-token)

   command-any        = "NOOP" / command-lang / "LOGOUT"

   command-auth       = command-delacl / command-dsince /
                        command-freectx / command-getquota /
                        command-lrights / command-myrights /
                        command-search / command-setacl /
                        command-store
                        ;; only valid in authenticated state

   command-delacl     = "DELETEACL" SPACE acl-object [SPACE acl-identifier]




Newman                                                         [Page 55]

Internet DRAFT                    ACAP                     June 19, 1997


   command-dsince     = "DELETEDSINCE" SPACE dataset SPACE time

   command-extend     = extend-token [SPACE extension-data]

   command-freectx    = "FREECONTEXT" SPACE context

   command-getquota   = "GETQUOTA" SPACE dataset

   command-lang       = "LANG" *(SPACE lang-tag)

   command-lrights    = "LISTRIGHTS" SPACE acl-object

   command-myrights   = "MYRIGHTS" SPACE acl-object

   command-nonauth    = command-authent
                        ;; only valid in non-authenticated state

   command-search     = "SEARCH" SPACE (dataset / context)
                        *(SPACE search-modifier)
                        SPACE search-criteria
                        ;; MUST NOT include same search-modifier twice

   command-setacl     = "SETACL" SPACE acl-object SPACE acl-identifier
                        SPACE acl-rights

   command-store      = "STORE" SPACE store-entry-list

   comparator         = <"> comparator-name <">

   comparator-name    = ["+" / "-"] iana-token

   context            = string-utf8
                        ;; MUST NOT begin with slash ("/")

   dataset            = string-utf8
                        ;; slash-separated dataset name
                        ;; begins with slash

   entry              = entry-name / entry-path

   entry-name         = string-utf8
                        ;; entry name MUST NOT contain slash
                        ;; MUST NOT begin with "."

   entry-path         = string-utf8
                        ;; slash-separated path to entry
                        ;; begins with slash




Newman                                                         [Page 56]

Internet DRAFT                    ACAP                     June 19, 1997


   entry-relative     = string-utf8
                        ;; potentially relative path to entry

   extend-token       = atom
                        ;; MUST be defined by a standards track or
                        ;; IESG approved experimental protocol extension

   extension-data     = extension-item *(SPACE extension-item)

   extension-item     = extend-token / string / number /
                        "(" [extension-data] ")"

   iana-token         = atom
                        ;; MUST be registered with IANA

   initial-greeting   = "*" SPACE "ACAP" *(SPACE "(" init-capability ")") CRLF

   init-capability    = init-cap-compare / init-cap-context /
                        init-cap-extend / init-cap-implem / init-cap-sasl

   init-cap-compare   = "COMPARATORS" SPACE string-list

   init-cap-context   = "CONTEXTLIMIT" SPACE string

   init-cap-extend    = iana-token [SPACE string-list]

   init-cap-implem    = "IMPLEMENTATION" SPACE string

   init-cap-sasl      = "SASL" SPACE string-list

   lang-tag           = <"> Language-Tag <">
                        ;; Language-Tag rule is defined in [LANG-TAGS]

   literal            = "{" number [ "+" ] "}" CRLF *OCTET
                        ;; The number represents the number of octets
                        ;; MUST be literal-utf8 except for values

   literal-utf8       = "{" number [ "+" ] "}" CRLF *UTF8-CHAR
                        ;; The number represents the number of octets
                        ;; not the number of characters

   metadata           = attribute [ "(" metadata-type-list ")" ]
                        ;; attribute MAY end in "*" as wildcard.

   metadata-list      = metadata *(SPACE metadata)

   metadata-type      = "attribute" / "myrights" / "size" /
                        "count" / metadata-write



Newman                                                         [Page 57]

Internet DRAFT                    ACAP                     June 19, 1997


   metadata-type-q    = <"> metadata-type <">

   metadata-type-list = metadata-type-q *(SPACE metadata-type-q)

   metadata-write     = "value" / "acl"

   metadata-write-q   = <"> metadata-write <">

   nil                = "NIL"

   nstring            = nil / string

   number             = *DIGIT
                        ;; A 32-bit unsigned number.
                        ;; (0 <= n < 4,294,967,296)

   nz-number          = DIGIT-NZ *DIGIT
                        ;; A 32-bit unsigned non-zero number.
                        ;; (0 < n < 4,294,967,296)

   position           = number
                        ;; "0" if context is not enumerated
                        ;; otherwise this is non-zero

   quota-limit        = number

   quota-root         = entry-path

   quota-usage        = number

   quoted             = <"> *QUOTED-CHAR <">
                        ;; limited to 1024 octets between the <">s

   response           = response-addto / response-alert / response-bye /
                        response-change / response-cont /
                        response-deleted / response-done / response-entry /
                        response-extend / response-listr /
                        response-lang / response-mtimei / response-mtimeu /
                        response-myright / response-quota /
                        response-refer / response-remove / response-stat

   response-addto     = "*" SPACE "ADDTO" SPACE context SPACE entry-name
                        SPACE position SPACE return-data-list

   response-alert     = "*" SPACE "ALERT" SPACE resp-body CRLF
                       ;; Client MUST display alert text to user





Newman                                                         [Page 58]

Internet DRAFT                    ACAP                     June 19, 1997


   response-bye       = "*" SPACE "BYE" SPACE resp-body CRLF
                       ;; Server will disconnect condition

   response-change    = "*" SPACE "CHANGE" SPACE context SPACE entry-name
                        SPACE position SPACE position SPACE return-data-list

   response-cont      = "+" SPACE (quoted / base64-token)

   response-deleted   = tag SPACE "DELETED" SPACE entry-name

   response-done      = tag SPACE resp-cond-state CRLF

   response-entry     = tag SPACE "ENTRY" SPACE entry SPACE return-data-list

   response-extend    = (tag / "*") SPACE extend-token [SPACE extension-data]

   response-lang      = "*" SPACE "LANG" SPACE lang-tag *(SPACE lang-tag)

   response-listr     = tag SPACE "LISTRIGHTS" SPACE acl-rights
                        *(SPACE acl-rights)

   response-mtimei    = tag SPACE "MODTIME" SPACE time

   response-mtimeu    = "*" SPACE "MODTIME" SPACE context SPACE time

   response-myright   = tag SPACE "MYRIGHTS" SPACE acl-rights

   response-quota     = "*" SPACE "QUOTA" SPACE dataset SPACE quota-root
                        SPACE quota-limit SPACE quota-usage

   response-refer     = tag SPACE "REFER" SPACE dataset 1*(SPACE
                        <"> url-relative <">)

   response-remove    = "*" SPACE "REMOVEFROM" SPACE context SPACE
                        entry-name SPACE position

   response-stat      = "*" SPACE resp-cond-state CRLF

   resp-body          = ["(" resp-code ")" SPACE] quoted

   resp-code          = "ENCRYPT-NEEDED" / resp-code-inval /
                        resp-code-many / resp-code-mod /
                        resp-code-noexist / resp-code-perm /
                        "PLAINTEXT-DENIED" / "QUOTA" / resp-code-refer /
                        "TRANSITION-NEEDED" / "TRYCACHE" /
                        "TRYFREECONTEXT" / resp-code-way / resp-code-ext





Newman                                                         [Page 59]

Internet DRAFT                    ACAP                     June 19, 1997


   resp-code-ext      = iana-token [SPACE extension-data]
                        ;; unknown response codes are ignored by the client.

   resp-code-inval    = "INVALID" 1*(SPACE entry-path SPACE attribute)

   resp-code-many     = "TOOMANY" SPACE nz-number

   resp-code-mod      = "MODIFIED" SPACE entry-path

   resp-code-noexist  = "NOEXIST" SPACE dataset

   resp-code-perm     = "PERMISSION" SPACE acl-object

   resp-code-refer    = "REFER" 1*(SPACE <"> url-relative <">)

   resp-code-way      = "WAYTOOMANY"

   resp-cond-state    = ("OK" / "NO" / "BAD") SPACE resp-body
                        ;; Status condition

   return-data        = "(" return-metadata *(SPACE return-metadata) ")"
                        ;; one return-data list is included per item in
                        ;; the RETURN statement

   return-data-list   = return-data *(SPACE return-data)

   return-metadata    = nil / string / value-list / acl

   searchkey-equal    = "EQUAL" SPACE attribute SPACE comparator
                        SPACE value-nil

   searchkey-comp     = "COMPARE" SPACE attribute SPACE comparator SPACE value

   searchkey-prefix   = "PREFIX" SPACE attribute SPACE comparator SPACE value

   searchkey-range    = "RANGE" SPACE nz-number SPACE nz-number
                        SPACE time

   searchkey-strict   = "COMPARESTRICT" SPACE attribute SPACE comparator
                        SPACE value

   searchkey-substr   = "SUBSTRING" SPACE attribute SPACE comparator
                         SPACE value

   searchmod-depth    = "DEPTH" SPACE number

   searchmod-hard     = "HARDLIMIT" SPACE nz-number




Newman                                                         [Page 60]

Internet DRAFT                    ACAP                     June 19, 1997


   searchmod-limit    = "LIMIT" SPACE number SPACE number

   searchmod-make     = "MAKECONTEXT" [SPACE "ENUMERATE"]
                        [SPACE "NOTIFY"] SPACE context

   searchmod-ninh     = "NOINHERIT"

   searchmod-return   = "RETURN" SPACE "(" [metadata-list] ")"

   searchmod-sort     = "SORT" SPACE "(" sort-list ")"

   search-criteria    = "ALL" / searchkey-equal / searchkey-comp /
                        searchkey-strict / searchkey-range /
                        searchkey-prefix / searchkey-substr /
                        "NOT" SPACE search-criteria /
                        "OR" SPACE search-criteria SPACE search-criteria /
                        "AND" SPACE search-criteria SPACE search-criteria

   search-modifier    = searchmod-depth / searchmod-hard /
                        searchmod-limit / searchmod-make / searchmod-ninh /
                        searchmod-return / searchmod-sort

   sort-list          = sort-item *(SPACE sort-item)

   sort-item          = attribute SPACE comparator

   store-entry        = "(" entry-path *(SPACE store-modifier)
                            *(SPACE attribute-store) ")"
                        ;; MUST NOT include the same store-modifier twice
                        ;; MUST NOT include the same attribute twice

   store-entry-list   = store-entry *(SPACE store-entry)
                        ;; MUST NOT include the same entry twice

   store-modifier     = store-mod-unchang / store-mod-nocreate

   store-mod-nocreate = "NOCREATE"

   store-mod-unchang  = "UNCHANGEDSINCE" SPACE time

   string             = quoted / literal

   string-list        = string *(SPACE string)

   string-utf8        = quoted / literal-utf8

   tag                = 1*32TAG-CHAR




Newman                                                         [Page 61]

Internet DRAFT                    ACAP                     June 19, 1997


   time               = <"> time-year time-month time-day time-hour
                        time-minute time-second time-subsecond <">
                        ;; Timestamp in UTC

   time-day           = 2DIGIT ;; 01-31

   time-hour          = 2DIGIT ;; 00-23

   time-minute        = 2DIGIT ;; 00-59

   time-month         = 2DIGIT ;; 01-12

   time-second        = 2DIGIT ;; 00-60

   time-subsecond     = *DIGIT

   time-year          = 4DIGIT

   value              = string

   value-any          = value-nil / value-list

   value-list         = "(" [value *(SPACE value)] ")"

   value-nil          = value / nil

   value-store        = value-any / acl

   url-acap           = "acap://" url-server "/" url-enc-entry [url-filter]
                        ;; url-enc-entry interpreted relative to "/"

   url-attr-list      = url-enc-attr *("&" url-enc-attr)

   url-auth           = ";AUTH=" ("*" / url-enc-auth)

   url-achar          = uchar / "&" / "=" / "~"
                        ;; See RFC 1738 for definition of "uchar"

   url-char           = uchar / "=" / "~" / ":" / "@" / "/"
                        ;; See RFC 1738 for definition of "uchar"

   url-enc-attr       = 1*url-char
                        ;; encoded version of attribute name

   url-enc-auth       = 1*url-achar
                        ;; encoded version of auth-type above





Newman                                                         [Page 62]

Internet DRAFT                    ACAP                     June 19, 1997


   url-enc-entry      = 1*url-char
                        ;; encoded version of entry-relative above

   url-enc-user       = *url-achar
                        ;; encoded version of login userid

   url-filter         = "?" url-attr-list

   url-relative       = url-acap / [url-enc-entry] [url-filter]
                        ;; url-enc-entry is relative to base URL

   url-server         = [url-user [url-auth] "@"] hostport
                        ;; See RFC 1738 for definition of "hostport"

9.       Multi-lingual Considerations

   The IAB charset workshop [IAB-CHARSET] came to a number of
   conclusions which influenced the design of ACAP.  The decision to use
   UTF-8 as the character encoding scheme was based on that work.  The
   LANG command to negotiate a language for error messages is also
   included.

   Section 3.4.5 of the IAB charset workshop report states that there
   should be a way to identify the natural language for human readable
   strings.  Several promising proposals have been made for use within
   ACAP, but no clear consensus on a single method is apparent at this
   stage.  The following rules are likely to permit the addition of
   multi-lingual support in the future:

   (1) A work in progress called Multi-Lingual String Format (MLSF)
   proposes a layer on top of UTF-8 which uses otherwise illegal UTF-8
   sequences to store language tags.  In order to permit its addition to
   a future version of this standard, client-side UTF-8 interpreters
   SHOULD silently ignore illegal multi-byte UTF-8 characters, and treat
   illegal single-byte UTF-8 characters as end of string markers.
   Servers, for the time being, MUST silently accept illegal UTF-8
   characters, except in attribute names and entry names.  Clients MUST
   NOT send illegal UTF-8 characters to the server unless a future
   standard changes this rule.

   (2) There is a proposal to add language tags to Unicode.  To support
   this, servers MUST be able to store UTF-8 characters of up to 20 bits
   of data.

   (3) The metadata item "language" is reserved for future use.

   (4) The ";" character in attribute names is reserved for future use.




Newman                                                         [Page 63]

Internet DRAFT                    ACAP                     June 19, 1997


10.      Security Considerations

   The AUTHENTICATE command uses SASL [SASL] to provide basic
   authentication, authorization, integrity and privacy services.  This
   is described in section ###.  The security considerations for the
   PLAIN SASL mechanism [SASL-PLAIN] also apply.

   ACAP protocol transactions are susceptible to passive observers or
   man in the middle attacks which alter the data, unless the optional
   encryption and integrity services of the AUTHENTICATE command are
   offered, or an external security mechanism is used for protection.
   It may be useful to allow configuration of both clients and servers
   to refuse to transfer sensitive information in the absence of strong
   encryption.

   ACAP access control lists provide fine grained authorization for
   access to attributes.  A number of related security issues are
   described in section ###.

   ACAP clients are encouraged to consider the security problems
   involved with a lab computer situation.  Specifically, a client cache
   of ACAP configuration information MUST NOT allow access by an
   unauthorized user.  One way to assure this is for an ACAP client to
   be able to completely flush any non-public cached configuration data
   when a user leaves.

   As laptop computers can be easily stolen and a cache of configuration
   data may contain sensitive information, a disconnected mode ACAP
   client may wish to encrypt and password protect cached configuration
   information.

11.      Acknowledgments

   Many thanks to the follow people who helped design ACAP over the past
   four years: Wallace Colyer, Mark Crispin, Jack DeWinter, Rob Earhart,
   Ned Freed, Randy Gellens, Terry Gray, J. S. Greenfield, Steve Hole,
   Steve Hubert, Dave Roberts, Bart Schaefer, Matt Wall and other
   participants of the IETF ACAP working group.

12.      Authors' Addresses

   Chris Newman
   Innosoft International, Inc.
   1050 Lakes Drive
   West Covina, CA 91790 USA

   Email: chris.newman@innosoft.com




Newman                                                         [Page 64]

Internet DRAFT                    ACAP                     June 19, 1997


   John Gardiner Myers
   Netscape Communications
   501 East Middlefield Road
   Mail Stop MV-029
   Mountain View, CA 94043

   Email: jgmyers@netscape.com

Appendices

A.       References

   [ABNF] Crocker, D., "Augmented BNF for Syntax Specifications: ABNF",
   Work in progress: draft-ietf-drums-abnf-xx.txt

   [BASIC-URL] Berners-Lee, Masinter, McCahill, "Uniform Resource
   Locators (URL)", RFC 1738, CERN, Xerox Coproration, University of
   Minnesota, December 1994.

       <ftp://ds.internic.net/rfc/rfc1738.txt>

   [IAB-CHARSET] Weider, Preston, Simonsen, Alvestrand, Atkinson,
   Crispin, Svanberg, "The Report of the IAB Character Set Workshop held
   29 February - 1 March, 1996", RFC 2130, April 1997.

       <ftp://ds.internic.net/rfc/rfc2130.txt>

   [IMAP4] Crispin, M., "Internet Message Access Protocol - Version
   4rev1", RFC 2060, University of Washington, December 1996.

       <ftp://ds.internic.net/rfc/rfc2060.txt>

   [IMAP-ACL] Myers, J., "IMAP4 ACL extension", RFC 2086, Carnegie
   Mellon, January 1997.

       <ftp://ds.internic.net/rfc/rfc2086.txt>

   [ISO-10646] ISO/IEC 10646-1:1993(E) "Information Technology--
   Universal Multiple-octet Coded Character Set (UCS)." See also
   amendments 1 through 7, plus editorial corrections.

   [ISO-C] "Programming languages -- C", ISO/IEC 9899:1990,
   International Organization for Standardization.  This is effectively
   the same as ANSI C standard X3.159-1989.







Newman                                                         [Page 65]

Internet DRAFT                    ACAP                     June 19, 1997


   [KEYWORDS] Bradner, "Key words for use in RFCs to Indicate
   Requirement Levels", RFC 2119, Harvard University, March 1997.

       <ftp://ds.internic.net/rfc/rfc2119.txt>

   [LANG-TAGS] Alvestrand, H., "Tags for the Identification of
   Languages", RFC 1766.

       <ftp://ds.internic.net/rfc/rfc1766.txt>

   [REL-URL] Fielding, "Relative Uniform Resource Locators", RFC 1808,
   UC Irvine, June 1995.

       <ftp://ds.internic.net/rfc/rfc1808.txt>

   [SASL] Myers, J., "Simple Authentication and Security Layer (SASL)",
   Work in progress: draft-myers-auth-sasl-xx.txt

   [SASL-ANON] Newman, "Anonymous SASL Mechanism", Work in progress:
   draft-newman-sasl-anon-xx.txt.

   [SASL-PLAIN] Newman, "Plaintext Password SASL Mechanism and
   Transition Codes", Work in progress: draft-newman-sasl-plaintrans-
   xx.txt.

   [UNICODE-2] The Unicode Consortium, "The Unicode Standard, Version
   2.0", Addison-Wesley, 1996. ISBN 0-201-48345-9.

   [US-ASCII] "USA Standard Code for Information Interchange," X3.4.
   American National Standards Institute: New York (1968).

   [UTF8] Yergeau, F. "UTF-8, a transformation format of Unicode and ISO
   10646", RFC 2044, Alis Technologies, October 1996.

       <ftp://ds.internic.net/rfc/rfc2044.txt>
















Newman                                                         [Page 66]

Internet DRAFT                    ACAP                     June 19, 1997


B.       ACAP Keyword Index


       ACAP (untagged response) ...................................   29
       ADDTO (untagged response) ..................................   42
       ALERT (untagged response) ..................................   33
       ALL (search keyword) .......................................   39
       AND (search keyword) .......................................   39
       AUTHENTICATE (command) .....................................   34
       BAD (response) .............................................   32
       BYE (untagged response) ....................................   33
       CHANGE (untagged response) .................................   43
       COMPARATORS (ACAP capability) ..............................   29
       COMPARE (search keyword) ...................................   39
       COMPARESTRICT (search keyword) .............................   39
       CONTEXTLIMIT (ACAP capability) .............................   29
       DELETEACL (command) ........................................   47
       DELETED (intermediate response) ............................   46
       DELETEDSINCE (command) .....................................   45
       DEPTH (search modifier) ....................................   36
       ENCRYPT-NEEDED (response code) .............................   20
       ENTRY (intermediate response) ..............................   40
       EQUAL (search keyword) .....................................   39
       FREECONTEXT (command) ......................................   41
       GETQUOTA (command) .........................................   49
       HARDLIMIT (search modifier) ................................   36
       IMPLEMENTATION (ACAP capability) ...........................   29
       INVALID (response code) ....................................   20
       LANG (command) .............................................   30
       LANG (untagged response) ...................................   31
       LIMIT (search modifier) ....................................   36
       LISTRIGHTS (command) .......................................   48
       LISTRIGHTS (intermediate response) .........................   49
       LOGOUT (command) ...........................................   31
       MAKECONTEXT (search modifier) ..............................   37
       MODIFIED (response code) ...................................   21
       MODTIME (intermediate response) ............................   40
       MODTIME (untagged response) ................................   43
       MYRIGHTS (command) .........................................   47
       MYRIGHTS (intermediate response) ...........................   48
       NO (response) ..............................................   32
       NOCREATE (store modifier) ..................................   44
       NOEXIST (response code) ....................................   21
       NOINHERIT (search modifier) ................................   37
       NOOP (command) .............................................   30
       NOT (search keyword) .......................................   39
       OK (response) ..............................................   31
       OR (search keyword) ........................................   39
       PERMISSION (response code) .................................   21



Newman                                                         [Page 67]

Internet DRAFT                    ACAP                     June 19, 1997



       PLAINTEXT-DENIED (response code) ...........................   21
       PREFIX (search keyword) ....................................   39
       QUOTA (response code) ......................................   21
       QUOTA (untagged response) ..................................   50
       RANGE (search keyword) .....................................   39
       REFER (intermediate response) ..............................   40
       REFER (response code) ......................................   21
       REMOVEFROM (untagged response) .............................   42
       RETURN (search modifier) ...................................   38
       SASL (ACAP capability) .....................................   29
       SEARCH (command) ...........................................   35
       SETACL (command) ...........................................   46
       SORT (search modifier) .....................................   38
       STORE (command) ............................................   44
       SUBSTRING (search keyword) .................................   40
       TOOMANY (response code) ....................................   21
       TRANSITION-NEEDED (response code) ..........................   21
       TRYCACHE (response code) ...................................   21
       TRYFREECONTEXT (response code) .............................   22
       UNCHANGEDSINCE (store modifier) ............................   44
       UPDATECONTEXT (command) ....................................   41
       WAYTOOMANY (response code) .................................   22
       acl (attribute metadata) ...................................   14
       anyone (ACL identifier) ....................................   19
       attribute (attribute metadata) .............................   14
       dataset.acl (dataset attribute) ............................   26
       dataset.acl.<attribute> (dataset attribute) ................   26
       dataset.inherit (dataset attribute) ........................   26
       en-nocase (comparator) .....................................   18
       entry (predefined attribute) ...............................   13
       modtime (predefined attribute) .............................   13
       myrights (attribute metadata) ..............................   14
       numeric (comparator) .......................................   18
       octet (comparator) .........................................   17
       quota.limit (predefined attribute) .........................   28
       quota.usage (predefined attribute) .........................   28
       size (attribute metadata) ..................................   14
       subdataset (predefined attribute) ..........................   13
       value (attribute metadata) .................................   15












Newman                                                         [Page 68]

